      ***************************************************************
      *                     -------------------                     *
      *                     ¦     REMARKS     ¦                     *
      *                     -------------------                     *
      *                                                             *
      * BGOW0002: TABELA DE RELACAO ENTRE AGENTE E DISTRITO.        *
      *                                                             *
      *    TAB-AGDT-AGENTE -> AGENTE                                *
      *    TAB-AGDT-DISTRI -> DISTRITO                              *
      *    TAB-AGDT-IMPRIM -> A - AGENCIA                           *
      *                       C - COBRANCAS                         *
      *                       T - CONTABILIDADE/TESOURARIA          *
      *                       U - DIRECCAO ADMINISTRATIVA           *
      *                       V - DIRECCAO ADMINISTRACAO DE PESSOAL *
      *                       G - CGD                               *
#AQ   *                       E - DOQ/SGD - CORRETOR JOÃO MATA      *
      *                       X - REJEITA E NAO IMPRIME             *
      *                                                             *
      ***************************************************************
      *                     -------------------                     *
      *                     ¦ MAINTENANCE LOG ¦                     *
      *                     -------------------                     *
      *                                                             *
      * PROG.    PCR       DATE    COMMENTS                         *
      * ----- --------- ---------- -------------------------------- *
      * PJG             2006-11-16 CRIACAO                          *
      *                                                             *
      * PJG             2007-02-21 ACRESCENTA DOIS NOVOS CODIGOS DE *
      *                            RETENCAO                         *
      *                                                             *
      * PJG             2007-02-22 RETIRA DUPLICADOS                *
      *                                                             *
      * PJG             2007-10-10 RETIRA O AGENTE 5008152          *
      *                                                             *
      * AG              2009-01-19 INCLUIR AGENTE 0000020095        *
      *                                                             *
      * PJG             2010-02-15 INCLUIR AGENTE 20181 NO SEGMENTO *
      *                            DE DISTR. INTERNA DE COBRANCAS   *
      *                                                             *
PJG#1 * PJG             2010-08-04 INCLUIR AGENTE 23082 NO SEGMENTO *
PJG#1 *                            DE DISTR. INTERNA DE COBRANCAS   *
PJG#1 *                                                             *
GO972 * AP              2010-09-30 INCLUIR AGENTES 08500 E 88591    *
PJG#2 *                                                             *
PJG#2 * PJG#2           2010-11-30 RETIRA DO MOVIMENTO DE COBRANCAS *
PJG#2 *                            OS AGENTES '000801*'. INCLUIR OS *
PJG#2 *                            AGENTES '000801*' E '000811*' NO *
PJG#2 *                            NOVO SEPARADOR <G> DA CGD.       *
PJG#2 *                                                             *
PJG#3 * PJG#3           2012-02-02 INCLUIR AGENTES 84988, 19201116, *
PJG#3 *                            19061766, 19190453 E 41135328 NO *
PJG#3 *                            SEGMENTO INTERNO DE COBRANCAS.   *
PJG#3 *                                                             *
PJG#4 * PJG#4 CHG102295 2012-03-28 INCLUIR OS AGENTES 41134714 E    *
PJG#4 *       CHG102383            5000418 NO SEGMENTO INTERNO DE   *
PJG#4 *                            COBRANCAS.                       *
PJG#4 *                                                             *
PJG#5 * PJG#5 CHG104201 2012-04-04 INCLUIR O AGENTE 5006842 NO      *
PJG#5 *                            SEGMENTO INTERNO DE COBRANCAS.   *
      *                                                             *
#12   * JADS  CHG113482 2012.05.15 INCLUSAO DO AGENTE 08028 NO      *
      *                            SEGMENTO INTERNO DE COBRANCAS.   *
      *                                                             *
PJG#6 * PJG#6 CHG118924 2012-06-14 INCLUIR O AGENTE 95041 NO        *
PJG#6 *                            SEGMENTO INTERNO DE COBRANCAS.   *
PJG#6 *                                                             *
PJG#7 * PJG#7 CHG121717 2012-06-20 INCLUIR O AGENTE 77021 NO        *
PJG#7 *                            SEGMENTO INTERNO DE COBRANCAS.   *
PJG#7 *                                                             *
PJG#8 * PJG#8 CHG122852 2012-06-25 INCLUIR OS AGENTES 93511, 82974, *
PJG#8 *                            40930449, 12990018 E 12990025 NO *
PJG#8 *                            SEGMENTO INTERNO DE COBRANCAS.   *
PJG#8 *                                                             *
PJG#9 * PJG#9 CHG123198 2012-06-26 INCLUIR O AGENTE 5008130 NO      *
PJG#9 *                            SEGMENTO INTERNO DE COBRANCAS.   *
PJG#9 *                                                             *
PJG#A * PJG#A CHG128969 2012-07-20 RETIRA DO MOVIMENTO DE COBRANCAS *
PJG#A *                            AS CONTAS '00043*****'.          *
PJG#A *                                                             *
PJG#B * PJG#B CHGXXXXXX 2012-07-23 INCLUIR OS AGENTES 7060449(FM) E *
PJG#B *                            01111706(IB) NO SEGMENTO INTERNO *
PJG#B *                            DE COBRANCAS.                    *
PJG#B *                                                             *
PJG#C * PJG#C CHG131586 2012-08-06 INCLUIR O AGENTE 19286324(IB) NO *
PJG#C *                            SEGMENTO INTERNO DE COBRANCAS.   *
      *                                                             *
#20   * JADS  CHG135362 2012.08.16 INCLUSAO DO AGENTE 95225 NO      *
      *                            SEGMENTO INTERNO DE COBRANCAS.   *
      *                                                             *
PJG#D * PJG#D CHG135642 2012-08-17 RETIRAR DO SEGMENTO INTERNO DE   *
PJG#D *                            COBRANCAS, 111 CONTAS INFORMADAS *
PJG#D *                            EM FICHEIRO EXCEL. RETIRAR DO    *
PJG#D *                            SEGMENTO INTERNO DE AGENCIAS AS  *
PJG#D *                            CONTAS 5005967 E 22446.          *
PJG#D *                                                             *
PJG#E * PJG#E CHG136148 2012-08-21 INCLUIR OS AGENTES 86941, 84556, *
PJG#E *       CHG136149            5007099 E 01156648 NO SEGMENTO   *
PJG#E *       CHG136166            INTERNO DE COBRANÇAS.            *
PJG#E *       CHG136229                                             *
PJG#E *                                                             *
PJG#F * PJG#F CHG136411 2012-08-22 INCLUIR OS AGENTES 12992779,     *
PJG#F *       CHG136450            22348 E 02011010 NO SEGMENTO     *
PJG#F *                            INTERNO DE COBRANÇAS.            *
PJG#F *                                                             *
PJG#G * PJG#G CHG139660 2012-09-14 INCLUIR OS AGENTES 5008726,      *
PJG#G *       CHG139975            70000329 E 70000195 NO SEGMENTO  *
PJG#G *       CHG140261            INTERNO DE COBRANÇAS.            *
PJG#G *                                                             *
PJG#H * PJG#H CHG140720 2012-09-28 INCLUIR OS AGENTES 20173, 21880, *
PJG#H *       CHG142191            89498, 94434, 5007981, 5008068,  *
PJG#H *       CHG142647            5011469, 1941558, 12006027,      *
PJG#H *       CHG140408            12991370 E 70000144 NO SEGMENTO  *
PJG#H *       CHG140407            INTERNO DE COBRANCAS.            *
PJG#H *       CHG144045                                             *
PJG#H *                                                             *
PJG#I * PJG#I CHG142304 2012-10-11 INCLUIR 239 CONTAS INFORMADAS EM *
PJG#I *                            FICHEIRO EXCEL, NO SEGMENTO      *
PJG#I *                            INTERNO DE AGENCIAS.             *
PJG#I *       CHG144046            INCLUIR O AGENTE 12994344 NO     *
PJG#I *                            SEGMENTO INTERNO DE COBRANCAS.   *
PJG#I *       CHG145418            RETIRAR DO SEGMENTO INTERNO DE   *
PJG#I *                            COBRANCAS, A CONTA 7005802.      *
PJG#I *                                                             *
PJG#J * PJG#J CHG146989 2012-10-15 INCLUIR O AGENTE 1420867 NO      *
PJG#J *                            SEGMENTO INTERNO DE COBRANCAS.   *
PJG#J *                                                             *
PJG#K * PJG#K CHG149112 2012-11-05 RETIRAR DO SEGMENTO INTERNO DE   *
PJG#K *                            COBRANCAS AS CONTAS 84988,       *
PJG#K *                            19061766 E 19201116.             *
PJG#K *       CHG149789            INCLUIR OS AGENTES 50531,        *
PJG#K *       CHG150280            5006727, 83897, 26617, 5011347,  *
PJG#K *       CHG150780            7723, 93678, 70000157, 70000180  *
PJG#K *       CHG151654            E 70000347 NO SEGMENTO INTERNO   *
PJG#K *       CHG151966            DE COBRANCAS.                    *
PJG#K *       CHG151967                                             *
PJG#K *       CHG153437                                             *
PJG#K *                                                             *
PJG#L * PJG#L CHG154740 2012-11-13 INCLUIR OS AGENTES 927, 2000362, *
PJG#L *                            5004694 E 5008721 NO SEGMENTO    *
PJG#L *                            INTERNO DE COBRANCAS.            *
PJG#L *       CHG154375            INCLUIR O AGENTE 2002229 NO      *
PJG#L *                            SEGMENTO INTERNO DE COBRANCAS.   *
      *                                                                *
#30   * JADS  CHG157499  2012.11.21  INCLUSAO DOS AGENTES 86401 (FM) E *
      *                              01407048 (IB) NO SEGMENTO INTERNO *
      *                              DE COBRANÇAS.                     *
      *       CHG157504              INCLUSAO DO AGENTE 02999743 (IB)  *
      *                              NO SEGMENTO INTERNO DE COBRANÇAS. *
      *                                                                *
#31   * JADS  CHG158731  2012.11.26  INCLUSAO DOS AGENTES 02003731 (IB)*
      *                              , 02010085 E 02991355 NO SEGMENTO *
      *                              INTERNO DE COBRANÇAS.             *
      *       CHG159515              INCLUSAO DO AGENTE 21771 (FM) NO  *
      *                              SEGMENTO INTERNO DE COBRANÇAS.    *
      *                                                                *
#32   * JADS  CHG161398  2012.12.03  INCLUSAO DO AGENTE 70000229 (IB)  *
      *                              NO SEGMENTO INTERNO DE COBRANÇAS. *
      *                                                                *
#33   * JADS  CHG162505  2012.12.11  INCLUSAO DO AGENTE 5008822 (FM)   *
      *                              NO SEGMENTO INTERNO DE COBRANÇAS. *
      *       CHG163497              INCLUSAO DOS AGENTES 02054 (FM) E *
      *                              12000506 (IB) NO SEGMENTO INTERNO *
      *                              DE COBRANÇAS.                     *
      *                                                                *
#34   * JADS  CHG165301  2012.12.14  INCLUSAO DO AGENTE 70000339 (IB)  *
      *                              NO SEGMENTO INTERNO DE COBRANÇAS. *
      *                                                                *
#35   * JADS  CHG165855  2012.12.18  INCLUSAO DO AGENTE 01530476 (IB)  *
      *                              NO SEGMENTO INTERNO DE COBRANÇAS. *
      *                                                                *
GO2291* AP    CHG167233  2012.12.26  INCLUSAO DO AGENTE 19299563 (IB)  *
      * GO2291                       NO SEGMENTO INTERNO DE COBRANÇAS. *
      *                                                                *
#37   * JADS  CHG167732  2012.12.31  EXCLUSAO DOS AGENTES 2054 (FM) E  *
      *                              12000506 (IB) DO SEGMENTO INTERNO *
      *                              DE COBRANÇAS.                     *
      *       CHG167734              INCLUSAO DOS AGENTES 89759 (FM) E *
      *                              31033207 (IB) NO SEGMENTO INTERNO *
      *                              DE COBRANÇAS.                     *
      *                                                                *
#38   * JADS  CHG169625  2013.01.09  INCLUSAO DO AGENTE 76355 (FM) NO  *
      *                              SEGMENTO INTERNO DE COBRANÇAS.    *
      *                                                                *
#39   * JADS  CHG170705  2013.01.11  INCLUSAO DOS AGENTES 12994803 E   *
      *                              12994985 (IB) NO SEGMENTO INTERNO *
      *                              DE COBRANÇAS.                     *
      *                                                                *
#40   * JADS  CHG171327  2013.01.15  INCLUSAO DOS AGENTES 89518 (FM) E *
      *                              19127059 (IB) NO SEGMENTO INTERNO *
      *                              DE COBRANÇAS.                     *
      *                                                                *
#41   * JADS  CHG172332  2013.01.17  EXCLUSAO DO AGENTE 12994344 (IB)  *
      *                              DO SEGMENTO INTERNO DE COBRANÇAS. *
      *                                                                *
#42   * JADS  CHG174120  2013.01.24  INCLUSAO DO AGENTE 5007304 (FM)   *
      *                              NO SEGMENTO INTERNO DE COBRANÇAS. *
      *       CHG174122              INCLUSAO DO AGENTE 23899 (FM) NO  *
      *                              SEGMENTO INTERNO DE COBRANÇAS.    *
      *                                                                *
#43   * JADS  CHG175207  2013.01.29  INCLUSAO DOS AGENTES 19139383 E   *
      *                              70000223 (IB) NO SEGMENTO INTERNO *
      *                              DE COBRANÇAS.                     *
      *                                                                *
#44   * JADS  CHG179661  2013.02.13  INCLUSAO DO AGENTE 22459 (FM),    *
      *                              5008454 (FM), 01877701 (IB),      *
      *                              01145797 (IB) E 19160860 (FM) NO  *
      *                              SEGMENTO INTERNO DE COBRANÇAS.    *
      *                                                                *
#45   * JADS  CHG181068  2013.02.19  INCLUSAO DO AGENTE 84952 (FM) NO  *
      *                              SEGMENTO INTERNO DE COBRANÇAS.    *
      *                                                                *
#46   * JADS  CHG182461  2013.02.25  INCLUSAO DO AGENTE 51685 (FM) NO  *
      *                              SEGMENTO INTERNO DE COBRANÇAS.    *
      *       CHG183456  2013.02.28  INCLUSAO DO AGENTE 19261186 (IB)  *
      *                              NO SEGMENTO INTERNO DE COBRANÇAS. *
      *                                                                *
#47   * JADS  CHG187723  2013.03.13  INCLUSAO DO AGENTE 5011243 (FM)   *
      *                              NO SEGMENTO INTERNO DE COBRANÇAS. *
      *                                                                *
#48   * JADS  CHG192002  2013.03.26  INCLUSAO DO AGENTE 12994344 (IB)  *
      *                              NO SEGMENTO INTERNO DE COBRANÇAS. *
      *                                                                *
#49   * JADS  CHG193549  2013.04.04  INCLUSAO DO AGENTE 89800 (FM) NO  *
      *                              SEGMENTO INTERNO DE COBRANÇAS.    *
      *                                                                *
#50   * JADS  CHG194537  2013.04.10  INCLUSAO DO AGENTE 89499 (FM) NO  *
      *                              SEGMENTO INTERNO DE COBRANÇAS.    *
      *                                                                *
#51   * JADS  CHG196772  2013.04.16  INCLUSAO DO AGENTE 21007 (FM) NO  *
      *                              SEGMENTO INTERNO DE COBRANÇAS.    *
      *                                                                *
#52   * JADS  CHG198101  2013.04.22  INCLUSAO DO AGENTE 20145 79472    *
      *                              (FM) E 01946666 (IB) NO SEGMENTO  *
      *                              INTERNO DE COBRANÇAS.             *
      *       CHG198104              INCLUSAO DO AGENTE 94513 (FM) NO  *
      *                              SEGMENTO INTERNO DE COBRANÇAS.    *
      *       CHG199188              INCLUSAO DO AGENTE 51104 (FM) E   *
      *                              E 02001824 (IB) NO SEGMENTO       *
      *                              INTERNO DE COBRANÇAS.             *
      *                                                                *
#53   * JADS  CHG201872  2013.05.06  INCLUSAO DO AGENTE 70000010 (IB)  *
      *                              NO SEGMENTO INTERNO DE COBRANÇAS. *
      *       CHG201997              EXCLUSAO DO AGENTE 26617 (FM) E   *
      *                              2002229 (IB) DO SEGMENTO INTERNO  *
      *                              DE COBRANÇAS.                     *
      *                                                                *
#54   * JADS  CHG203059  2013.05.14  INCLUSAO DO AGENTE 95359 (FM) NO  *
      *                              SEGMENTO INTERNO DE COBRANÇAS.    *
      *       CHG204770  2013.05.14  INCLUSAO DO AGENTE 80906 (FM) E   *
      *                              2008540 (IB) NO SEGMENTO INTERNO  *
      *                              DE COBRANÇAS.                     *
      *       CHG205375  2013.05.28  INCLUSAO DO AGENTE 80936 (FM) E   *
      *                              19314735 (IB) NO SEGMENTO INTERNO *
      *                              DE COBRANÇAS.                     *
      *       CHG206164  2013.05.28  INCLUSAO DO AGENTE 88058, 95262 E *
      *                              5008555 (FM) NO SEGMENTO INTERNO  *
      *                              DE COBRANÇAS.                     *
      *       CHG208847  2013.05.28  INCLUSAO DO AGENTE 23740 (FM) NO  *
      *                              SEGMENTO INTERNO DE COBRANÇAS.    *
      *                                                                *
#55   * JADS  CHG209675  2013.05.30  INCLUSAO DO AGENTE 95258 (FM) NO  *
      *                              SEGMENTO INTERNO DE COBRANÇAS.    *
      *       CHG210252  2013.05.30  INCLUSAO DO AGENTE 50607, 98477   *
      *                              (FM) E 70000254 (IB) NO SEGMENTO  *
      *                              INTERNO DE COBRANÇAS.             *
      *                                                                *
#56   * JADS  CHG210831  2013.06.04  INCLUSAO DO AGENTE 31237577 (IB)  *
      *                              NO SEGMENTO INTERNO DE COBRANÇAS. *
      *       CHG211443  2013.06.05  INCLUSAO DO AGENTE 22343 (FM) E   *
      *                              5008319 (IB) NO SEGMENTO INTERNO  *
      *                              DE COBRANÇAS.                     *
      *                                                                *
#57   * JADS  CHG212390  2013.06.12  INCLUSAO DO AGENTE 22585 (FM) E   *
      *                              94830 (FM) NO SEGMENTO INTERNO DE *
      *                              COBRANÇAS.                        *
      *       CHG213063  2013.06.12  INCLUSAO DO AGENTE 5007181 (FM)   *
      *                              NO SEGMENTO INTERNO DE COBRANÇAS. *
      *                                                                *
#58   * JADS  CHG214613  2013.06.20  INCLUSAO DO AGENTE 41135188 (IB)  *
      *                              NO SEGMENTO INTERNO DE COBRANÇAS. *
      *                                                                *
#59   * JADS  CHG215569  2013.06.24  INCLUSAO DO AGENTE 59523 (FM) E   *
      *                              70000002 (IB) NO SEGMENTO INTERNO *
      *                              DE COBRANÇAS.                     *
      *       CHG215579  2013.06.24  INCLUSAO DO AGENTE 22827 (FM) E   *
      *                              30705150 (IB) NO SEGMENTO INTERNO *
      *                              DE COBRANÇAS.                     *
      *       CHG215943  2013.06.24  INCLUSAO DO AGENTE 86283 (FM) NO  *
      *                              SEGMENTO INTERNO DE COBRANÇAS.    *
      *       CHG216277  2013.06.26  INCLUSAO DO AGENTE 93887 (FM) NO  *
      *                              SEGMENTO INTERNO DE COBRANÇAS.    *
      *                                                                *
#60   * JADS  CHG216626  2013.07.01  INCLUSAO DO AGENTE 01934913 (FM)  *
      *                              NO SEGMENTO INTERNO DE COBRANÇAS. *
      *       CHG217653  2013.07.02  INCLUSAO DO AGENTE 89710 (FM) NO  *
      *                              SEGMENTO INTERNO DE COBRANÇAS.    *
      *                                                                *
#61   * JADS  CHG223941  2013.07.22  INCLUSAO DO AGENTE 30723478 (FM)  *
      *                              NO SEGMENTO INTERNO DE COBRANÇAS. *
      *                                                                *
#62   * JADS  CHG224891  2013.07.25  INCLUSAO DO AGENTE 41033848 (IB)  *
      *                              NO SEGMENTO INTERNO DE COBRANÇAS. *
      *                                                                *
#63   * JADS  CHG224891  2013.08.01  INCLUSAO DO AGENTE 30722875 (IB)  *
      *                              NO SEGMENTO INTERNO DE COBRANÇAS. *
      *       CHG226362  2013.08.01  INCLUSAO DO AGENTE 70000231 (IB), *
      *                              19202901 (IB) NO SEGMENTO INTERNO *
      *                              DE COBRANÇAS.                     *
      *       CHG226722  2013.08.01  INCLUSAO DO AGENTE 19287220 (IB)  *
      *                              NO SEGMENTO INTERNO DE COBRANÇAS. *
      *                                                                *
#64   * JADS  CHG227564  2013.08.06  INCLUSAO DO AGENTE 95439 (FM) NO  *
      *                              SEGMENTO INTERNO DE COBRANÇAS.    *
      *                                                                *
#65   * JADS  CHG228487  2013.08.09  INCLUSAO DO AGENTE 88672 (FM) NO  *
      *                              SEGMENTO INTERNO DE COBRANÇAS.    *
      *       CHG228489  2013.08.09  INCLUSAO DO AGENTE 70000289 (IB)  *
      *                              NO SEGMENTO INTERNO DE COBRANÇAS. *
      *                                                                *
#66   * JADS  CHG228821  2013.08.12  INCLUSAO DO AGENTE 20179 (FM),    *
      *                              22104 (FM), 12010528 (IB),        *
      *                              19314866 (IB) NO SEGMENTO INTERNO *
      *                              DE COBRANÇAS.                     *
      *                                                                *
#67   * JADS  CHG229710  2013.08.16  INCLUSAO DO AGENTE 80817 (FM),    *
      *                              90819 (FM), 01699570 (IB) NO      *
      *                              SEGMENTO INTERNO DE COBRANÇAS.    *
      *                                                                *
#68   * JADS  CHG230212  2013.08.20  INCLUSAO DO AGENTE 12994248 (IB)  *
      *                              NO SEGMENTO INTERNO DE COBRANÇAS. *
      *       CHG230372  2013.08.20  INCLUSAO DO AGENTE 51549 (FM) NO  *
      *                              SEGMENTO INTERNO DE COBRANÇAS.    *
      *                                                                *
#69   * JADS  CHG231508  2013.09.02  INCLUSAO DO AGENTE 5007800 (FM)   *
      *                              NO SEGMENTO INTERNO DE COBRANÇAS. *
      *       CHG231889  2013.09.02  INCLUSAO DO AGENTE 5000391 (FM)   *
      *                              NO SEGMENTO INTERNO DE COBRANÇAS. *
      *       CHG232226  2013.09.02  INCLUSAO DO AGENTE 5008344 (FM) E *
      *                              19141109 (IB) NO SEGMENTO INTERNO *
      *                              DE COBRANÇAS.                     *
      *                                                                *
#70   * JADS  CHG233122  2013.09.03  INCLUSAO DO AGENTE 01718356 (IB)  *
      *                              NO SEGMENTO INTERNO DE COBRANÇAS. *
      *       CHG233123  2013.09.03  INCLUSAO DO AGENTE 12993114 (IB)  *
      *                              NO SEGMENTO INTERNO DE COBRANÇAS. *
      *       CHG233124  2013.09.03  INCLUSAO DO AGENTE 86016 (FM) E   *
      *                              40827335 (IB) NO SEGMENTO INTERNO *
      *                              DE COBRANÇAS.                     *
      *       CHG233133  2013.09.03  INCLUSAO DO AGENTE 79589 (FM) NO  *
      *                              SEGMENTO INTERNO DE COBRANÇAS.    *
      *                                                                *
#71   * JADS  CHG235359  2013.09.12  INCLUSAO DO AGENTE 5006293 (FM) E *
      *                              02005753 (IB) NO SEGMENTO INTERNO *
      *                              DE COBRANÇAS.                     *
      *                                                                *
#72   * JADS  CHG238447  2013.09.24  INCLUSAO DO AGENTE 02012814 (IB), *
      *                              40724201, 88770 (FM), 5000247,    *
      *                              08078 NO SEGMENTO INTERNO DE      *
      *                              COBRANÇAS.                        *
      *       CHG238447  2013.09.26  INCLUSAO DO AGENTE 95685 (FM),    *
      *                              24992, 02000290 (IB), 34148213,   *
      *                              12991207 NO SEGMENTO INTERNO DE   *
      *                              COBRANÇAS.                        *
      *                                                                *
#73   * JADS  CHG240427  2013.10.03  INCLUSAO DO AGENTE 20695 (FM) E   *
      *                              70000285 (IB) NO SEGMENTO INTERNO *
      *                              DE COBRANÇAS.                     *
      *                                                                *
#74   * JADS  CHG241196  2013.10.04  INCLUSAO DO AGENTE 96444 (FM),    *
      *                              41339489 (IB) E 19261012 NO       *
      *                              SEGMENTO INTERNO DE COBRANÇAS.    *
      *                                                                *
#75   * JADS  CHG242243  2013.10.08  INCLUSAO DO AGENTE 94179 (FM),    *
      *                              95505, 23983 E 21672 NO SEGMENTO  *
      *                              INTERNO DE COBRANÇAS.             *
      *       CHG242940  2013.10.10  INCLUSAO DO AGENTE 79761 (FM),    *
      *                              88552, 95524, 95246, 1948215 (IB) *
      *                              NO SEGMENTO INTERNO DE COBRANÇAS. *
      *                  2013.10.10  INCLUSAO DO AGENTE 95273 (FM) NO  *
      *                              SEGMENTO INTERNO DE COBRANÇAS.    *
      *                              (ESTA CONTA DEVERIA TER SIDO IN-  *
      *                              CLUIDA EM 2013.09.03 CHG233124)   *
      *                                                                *
#76   * JADS  CHG245351  2013.10.17  INCLUSAO DO AGENTE 3004068 (FM)   *
      *                              NO SEGMENTO INTERNO DE COBRANÇAS. *
      *                                                                *
#77   * JADS  CHG246394  2013.10.21  INCLUSAO DO AGENTE 90804 (FM),    *
      *                              12992867 (IB) E 70000192 NO       *
      *                              SEGMENTO INTERNO DE COBRANÇAS.    *
      *       CHG247235  2013.10.24  INCLUSAO DO AGENTE 30724301 (IB), *
      *                              01585354 E 01958130 NO SEGMENTO   *
      *                              INTERNO DE COBRANÇAS.             *
      *                                                                *
#78   * JADS  CHG248347  2013.10.29  INCLUSAO DO AGENTE 5004798 (FM)   *
      *                              NO SEGMENTO INTERNO DE COBRANÇAS. *
      *       CHG249458  2013.10.31  INCLUSAO DO AGENTE 92553 (FM),    *
      *                              76494 E 30704495 (IB) NO SEGMENTO *
      *                              INTERNO DE COBRANÇAS.             *
      *                                                                *
#79   * JADS  CHG250436  2013.11.06  INCLUSAO DOS AGENTES (FM) 20528,  *
      *                              21869, 26623, 89279, (IB)         *
      *                              12993135, 12993107, 12993116,     *
      *                              41134410 NO SEGMENTO INTERNO DE   *
      *                              COBRANÇAS.                        *
      *       CHG251366  2013.11.07  INCLUSAO DOS AGENTES (FM) 95395,  *
      *                              (IB) 12992576, 12992580, 19261143 *
      *                              , 30826649 NO SEGMENTO INTERNO DE *
      *                              COBRANÇAS.                        *
      *                                                                *
#80   * JADS  CHG252432  2013.11.13  INCLUSAO DOS AGENTES (FM) 5008312 *
      *                              E (IB) 01439680, 12993974 NO      *
      *                              SEGMENTO INTERNO DE COBRANÇAS.    *
      *                                                                *
#81   * JADS  CHG255229  2013.11.21  INCLUSAO DOS AGENTES (FM) 53082 E *
      *                              (IB) 01442812 NO SEGMENTO INTERNO *
      *                              DE COBRANÇAS.                     *
      *       CHG255230  2013.11.21  EXCLUSAO DO AGENTE (IB) 19287220  *
      *                              DO SEGMENTO INTERNO DE COBRANÇAS. *
      *                                                                *
#82   * JADS  CHG257830  2013.12.05  INCLUSAO DOS AGENTES (FM) 85518,  *
      *                              5007975 E (IB) 40929080 NO        *
      *                              SEGMENTO INTERNO DE COBRANÇAS.    *
      *       CHG259438  2013.12.05  INCLUSAO DOS AGENTES (FM) 89555 E *
      *                              88583 NO SEGMENTO INTERNO DE      *
      *                              COBRANÇAS.                        *
      *                                                                *
#83   * JADS  CHG260709  2013.12.12  INCLUSAO DOS AGENTES (FM) 23489 E *
      *                              (IB) 12994352 NO SEGMENTO INTERNO *
      *                              DE COBRANÇAS.                     *
      *       CHG261417  2013.12.12  INCLUSAO DO AGENTE (IB) 19312107  *
      *                              NO SEGMENTO INTERNO DE COBRANÇAS. *
      *                                                                *
PJG#M * PJG#M CHG262537 2012-12-20 INCLUIR O AGENTE 01663308 NO     *
PJG#M *                            SEGMENTO INTERNO DE COBRANCAS.   *
PJG#M *                                                             *
PJG#N * PJG#N CHG263635 2012-12-26 INCLUIR O AGENTE 41237073 NO     *
PJG#N *                            SEGMENTO INTERNO DE COBRANCAS.   *
      *                                                                *
#86   * JADS  CHG260709  2014.01.02  INCLUSAO DOS AGENTES 22791, 94834 *
      *                              E 19282913 NO SEGMENTO INTERNO DE *
      *                              COBRANÇAS.                        *
      *                                                                *
#87   * JADS  CHG265856  2014.01.08  INCLUSAO DO AGENTE 01992136 (IB)  *
      *                              NO SEGMENTO INTERNO DE COBRANÇAS. *
      *       CHG266078  2014.01.08  INCLUSAO DO AGENTE 31134553 (IB)  *
      *                              NO SEGMENTO INTERNO DE COBRANÇAS. *
      *                                                                *
#88   * JADS  CHG267279  2014.01.10  INCLUSAO DO AGENTE 96619 (FM) NO  *
      *                              SEGMENTO INTERNO DE COBRANÇAS.    *
      *                                                                *
#89   * JADS  CHG271110  2014.01.22  INCLUSAO DO AGENTE 5006605 (FM),  *
      *                              77036, 01871991 (IB), 70000244 NO *
      *                              SEGMENTO INTERNO DE COBRANÇAS.    *
      *       CHG271904  2014.01.23  INCLUSAO DO AGENTE 20668 (FM),    *
      *                              89875, 19202776 (IB), 44601111,   *
      *                              40724156, 12990032 NO SEGMENTO    *
      *                              INTERNO DE COBRANÇAS.             *
      *                                                                *
#90   * JADS  CHG273095  2014.01.28  INCLUSAO DO AGENTE 19260511 (IB)  *
      *                              NO SEGMENTO INTERNO DE COBRANÇAS. *
      *       CHG274681  2014.01.30  INCLUSAO DO AGENTE 76453 (FM),    *
      *                              5011565, 5005777, 12990335 (IB)   *
      *                              NO SEGMENTO INTERNO DE COBRANÇAS. *
      *                                                                *
#91   * JADS  CHG277293  2014.02.06  INCLUSAO DOS AGENTES 12991346 E   *
      *                              12991354 NO SEGMENTO INTERNO DE   *
      *                              COBRANÇAS.                        *
      *                                                                *
#92   * JADS  CHG278365  2014.02.11  INCLUSAO DO AGENTE 07966 (FM),    *
      *                              86364, 84185 E 95749 NO SEGMENTO  *
      *                              INTERNO DE COBRANÇAS.             *
      *       CHG279645  2014.02.13  INCLUSAO DO AGENTE 75300 (FM),    *
      *                              95528, 01993147 (IB) E 02015580   *
      *                              NO SEGMENTO INTERNO DE COBRANÇAS. *
      *                                                                *
#93   * JADS  CHG280984  2014.02.18  INCLUSAO DO AGENTE 23368 (FM),    *
      *                              21837, 5008528, 95376, 01140208   *
      *                              (IB), 12991880, 1804254, 19171498 *
      *                              NO SEGMENTO INTERNO DE COBRANÇAS. *
      *       CHG281902  2014.02.20  INCLUSAO DO AGENTE 91231 (FM),    *
      *                              07753 E 5010307 NO SEGMENTO       *
      *                              INTERNO DE COBRANÇAS.             *
      *                                                                *
#94   * JADS  CHG282965  2014.02.26  INCLUSAO DO AGENTE 19244642 (IB)  *
      *                              E 02013307 NO SEGMENTO INTERNO DE *
      *                              COBRANÇAS.                        *
      *       CHG284115  2014.02.27  INCLUSAO DO AGENTE 73185 (FM),    *
      *                              21343, 01662065 (IB) E 19237688   *
      *                              NO SEGMENTO INTERNO DE COBRANÇAS. *
      *                                                                *
#95   * JADS  CHG285090  2014.03.05  INCLUSAO DO AGENTE 01071492 (IB)  *
      *                              E 92132 (FM) NO SEGMENTO INTERNO  *
      *                              DE COBRANÇAS.                     *
      *       CHG285699  2014.03.06  INCLUSAO DO AGENTE 5008031 (FM),  *
      *                              40724397 (IB) E 12991936 NO       *
      *                              SEGMENTO INTERNO DE COBRANÇAS.    *
      *                                                                *
#96   * JADS  CHG286799  2014.03.12  INCLUSAO DO AGENTE 50879 (FM) NO  *
      *                              SEGMENTO INTERNO DE COBRANÇAS.    *
      *       CHG286799  2014.03.13  INCLUSAO DO AGENTE 94300 (FM),    *
      *                              84503, 78684, 84982, 95057,       *
      *                              02990002 (IB), 02005868, 02990005 *
      *                              NO SEGMENTO INTERNO DE COBRANÇAS. *
      *                                                                *
#97   * JADS  CHG288799  2014.03.18  INCLUSAO DO AGENTE 5002282 (FM),  *
      *                              83576, 95778, 23224, 26941, 86033 *
      *                              , 40707815 (IB), 70000035,        *
      *                              40930055, 02003125, 02006887      *
      *                              NO SEGMENTO INTERNO DE COBRANÇAS. *
      *       CHG289722  2014.03.20  INCLUSAO DO AGENTE 85386 (FM),    *
      *                              93474, 26617, 02002229 (IB) NO    *
      *                              SEGMENTO INTERNO DE COBRANÇAS.    *
      *                                                                *
#98   * JADS  CHG290640  2014.03.24  INCLUSAO DO AGENTE 24041 (FM) NO  *
      *                              SEGMENTO INTERNO DE COBRANÇAS.    *
      *                                                                *
#99   * JADS  CHG293048  2014.04.01  INCLUSAO DO AGENTE 01079777 (IB)  *
      *                              NO SEGMENTO INTERNO DE COBRANÇAS. *
      *                                                                *
#AA   * JADS  CHG294189  2014.04.07  INCLUSAO DO AGENTE 5007941 (FM)   *
      *                              NO SEGMENTO INTERNO DE COBRANÇAS. *
      *                                                                *
#AB   * JADS  CHG295034  2014.04.16  INCLUSAO DO AGENTE 80223 (FM)     *
      *                              NO SEGMENTO INTERNO DE COBRANÇAS. *
      *       CHG296094  2014.04.16  INCLUSAO DO AGENTE 12994379 (IB)  *
      *                              NO SEGMENTO INTERNO DE COBRANÇAS. *
      *                                                                *
#AC   * JADS  CHG298413  2014.04.23  INCLUSAO DO AGENTE 70000245 (IB)  *
      *                              NO SEGMENTO INTERNO DE COBRANÇAS. *
      *       CHG298415  2014.04.23  INCLUSAO DO AGENTE 5008443 (FM),  *
      *                              24149, 95764, 23495, 23500, 95397 *
      *                              , 84553, 12008188 (IB), 12000282, *
      *                              12005040 NO SEGMENTO INTERNO DE   *
      *                              COBRANÇAS.                        *
      *       CHG298745  2014.04.23  INCLUSAO DO AGENTE 01912319 (IB)  *
      *                              NO SEGMENTO INTERNO DE COBRANÇAS. *
      *                                                                *
#AD   * JADS  CHG299533  2014.04.29  INCLUSAO DO AGENTE 98550 (FM)     *
      *                              NO SEGMENTO INTERNO DE COBRANÇAS. *
      *                                                                *
#AE   * JADS  CHG302115  2014.05.09  INCLUSAO DO AGENTE 79848 (FM)     *
      *                              NO SEGMENTO INTERNO DE COBRANÇAS. *
      *       CHG302857  2014.05.13  INCLUSAO DO AGENTE 08231 (FM)     *
      *                              NO SEGMENTO INTERNO DE COBRANÇAS. *
      *                                                                *
#AF   * JADS  CHG303439  2014.05.14  INCLUSAO DO AGENTE 96672 (FM),    *
      *                              02017279 (IB), 01717775, 41339264 *
      *                              NO SEGMENTO INTERNO DE COBRANÇAS. *
      *                                                                *
#AG   * JADS  CHG305366  2014.05.22  INCLUSAO DO AGENTE 94161 (FM),    *
      *                              19242276 (IB) NO SEGMENTO INTERNO *
      *                              DE COBRANÇAS.                     *
      *                                                                *
#AH   * JADS  CHG306331  2014.05.27  INCLUSAO DO AGENTE 95862 (FM),    *
      *                              96949, 02001066 (IB) NO SEGMENTO  *
      *                              INTERNO DE COBRANÇAS.             *
      *       CHG307116  2014.05.29  INCLUSAO DO AGENTE 5001406 (FM),  *
      *                              20633 NO SEGMENTO INTERNO DE      *
      *                              COBRANÇAS.                        *
      *                                                                *
#AI   * JADS  CHG309159  2014.06.06  INCLUSAO DO AGENTE 5008771 (FM),  *
      *                              89183, 1034015, 21417, 22142,     *
      *                              53215, 73155, 81049, 95764,       *
      *                              1033930, 1034063, 23515, 3008993, *
      *                              5004905, 87001, 95397, 95762,     *
      *                              70000055 (IB), 01931253, 10721461,*
      *                              12888197, 16999927, 16999994,     *
      *                              12999145, 12888103, 12888111,     *
      *                              12888138, 12888146, 12888883,     *
      *                              12888891, 12990030, 12999006,     *
      *                              NO SEGMENTO INTERNO DE COBRANÇAS. *
      *           (NOTA: 95397 E 95764 JÁ EXISTIAM DO CHG298415 - #AC) *
      *                                                                *
#AJ   * JADS  CHG311415  2014.06.19  INCLUSAO DO AGENTE 95043 (FM),    *
      *                              22978, 02011731 (IB) NO SEGMENTO  *
      *                              INTERNO DE COBRANÇAS.             *
      *                                                                *
#AK   * JADS  CHG312338  2014.06.24  INCLUSAO DO AGENTE 12994440 (IB)  *
      *                              NO SEGMENTO INTERNO DE COBRANÇAS. *
      *                                                                *
#AL   * JADS             2014.06.24  ACERTO NO NUMERO DE OCORRENCIAS   *
      *                              DA TABELA INTERNA (VERIFICOU-SE Q *
      *                              FALTAVA 1, PROBLEMA TALVEZ ESTEJA *
      *                              QUANDO PASSOU DE 1993 PARA 1995.  *
      *                                                                *
#AM   * JADS  CHG313220  2014.06.27  INCLUSAO DO AGENTE 95396 (FM),    *
      *                              30931456 (IB) NO SEGMENTO INTERNO *
      *                              DE COBRANÇAS.                     *
      *                                                                *
#AN   * JADS  CHGXXXXXX  2015.06.04  ANULAÇÃO DO REDIRECIONAMENTO PARA *
      *                              O SEGMENTO INTERNO DA DCO. CONTAS *
      *                              23495 23500 23515 3008993 5004905 *
      *                              95397 87001 95762 12000282        *
      *                              12999006 12999145 12005040        *
      *                              12888103 12888111 12888138        *
      *                              12888146 12888883 12888891        *
      *                              12990030                          *
      *                                                                *
#AO   * JADS  CHG444266  2015.11.26  ACTUALIZAÇÃO GLOBAL DO UNIVERSO DE*
      *                              CONTAS DEFINIDAS PARA REDIRECCIO- *
      *                              NAMENTO DE CORRESPONDENCIA PARA O *
      *                              SEGMENTO INTERNO DA DCO.          *
      *                              FICHEIRO COM LISTA NO CHG, EMAIL. *
      *                              (PASSAM DE 1185 -> 218 CONTAS)    *
      *                                                                *
#AP   * JADS  CHG538160  2016.11.12  PEDIDO DE RETIRADA DO MOVIMENTO   *
      *                              RETIDO PARA AS COBRANÇAS DE 218   *
      *                              CONTAS IDENTIFICADAS COM C, CON-  *
      *                              FORME LISTA DADA.                 *
      *                                                                *
#AQ   * FLCM  CHG550493  2016.11.25  CRIACAO DO NOVO SEPARADOR         *
#AQ   *                              'DOQ/SGD - CORRETOR JOÃO MATA '   *
#AQ   *                              COM CODIGO DE MEDIADOR FICTICIO   *
#AQ   *                              9999906028 POR FORMA A IMPLEMENTAR*
#AQ   *                              SEPARAÇÃO PARA CORREIO INTERNO DE *
#AQ   *                              EXTRATOS DE BENEFICIOS DAS APÓLICE*
#AQ   *                              9905941 ATÉ 9905950 - MHS         *
      *                                                                *
#AR   * JADS  CHG660921  2017.11.23  PEDIDO DE RETIRADA DE MOVIMENTO   *
      *                              RETIDO DE 971 CONTAS CONFORME     *
      *                              LISTA DADA PELA DSC (NUNO FERNAN).*
      *                                                                *
      ******************************************************************
       01  TABELA-AGDT.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0000000039069C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0000000055069C'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0000000117036A'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0000000120069C'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0000000202014A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0000000215425A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0000000216035A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0000000228495A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0000000250446A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0000000263066A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0000000269016A'.
         03  FILLER                 PIC X(14)  VALUE '0000000332081A'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0000000399069C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0000000468069C'.
         03  FILLER                 PIC X(14)  VALUE '0000000490430A'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0000000519050C'.
PJG#D *  03  FILLER                 PIC X(14)  VALUE '0000000567064C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0000000583069C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0000000610069C'.
         03  FILLER                 PIC X(14)  VALUE '0000000666890T'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0000000700439A'.
         03  FILLER                 PIC X(14)  VALUE '0000000880068T'.
PJG#AO*  03  FILLER                 PIC X(14)  VALUE '0000000927000C'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0000001036443A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0000001069493A'.
         03  FILLER                 PIC X(14)  VALUE '0000001347068T'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0000001664401A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0000001674407A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0000001771034A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0000001772028A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0000001773037A'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0000001888085C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0000001893085C'.
         03  FILLER                 PIC X(14)  VALUE '0000001897068T'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0000001917069C'.
#33#37*  03  FILLER                 PIC X(14)  VALUE '0000002054000C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0000002548069C'.
         03  FILLER                 PIC X(14)  VALUE '0000004658079A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0000004734070A'.
         03  FILLER                 PIC X(14)  VALUE '0000005671462A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0000006151832A'.
         03  FILLER                 PIC X(14)  VALUE '0000006157078A'.
         03  FILLER                 PIC X(14)  VALUE '0000006173446A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0000006214449A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0000006279029A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0000006383074A'.
         03  FILLER                 PIC X(14)  VALUE '0000006458819A'.
         03  FILLER                 PIC X(14)  VALUE '0000006463820A'.
         03  FILLER                 PIC X(14)  VALUE '0000006465804A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0000006468104A'.
         03  FILLER                 PIC X(14)  VALUE '0000006477867A'.
         03  FILLER                 PIC X(14)  VALUE '0000006645068T'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0000006676050C'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0000006732038A'.
         03  FILLER                 PIC X(14)  VALUE '0000006733072A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0000006867080A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0000006868440A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0000007010018A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0000007052013A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0000007068083A'.
         03  FILLER                 PIC X(14)  VALUE '0000007069042A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0000007149017A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0000007183073A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0000007255067A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0000007460494A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0000007496496A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0000007602452A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0000007636408A'.
         03  FILLER                 PIC X(14)  VALUE '0000007641412A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0000007653409A'.
PJG#AO*  03  FILLER                 PIC X(14)  VALUE '0000007723000C'.
#93#AP*  03  FILLER                 PIC X(14)  VALUE '0000007753000C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0000007755069C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0000007758069C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0000007869069C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0000007917085C'.
#92#AP*  03  FILLER                 PIC X(14)  VALUE '0000007966000C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0000007969069C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0000007973069C'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0000008015452A'.
#12#AO*  03  FILLER                 PIC X(14)  VALUE '0000008028000C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0000008039069C'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0000008066071A'.
#72#AO*  03  FILLER                 PIC X(14)  VALUE '0000008078000C'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0000008099492A'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0000008123069C'.
#AE#AP*  03  FILLER                 PIC X(14)  VALUE '0000008231000C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0000008245069C'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0000008374052A'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0000008451085C'.
PJG#D *  03  FILLER                 PIC X(14)  VALUE '0000008480085C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0000008488056C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0000008500050C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0000008501069C'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0000008871030A'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0000015596059C'.
         03  FILLER                 PIC X(14)  VALUE '0000016645068T'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0000017503069C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0000017906069C'.
PJG#D *  03  FILLER                 PIC X(14)  VALUE '0000017952485C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0000018765059C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0000019016059C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0000019023059C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0000019161059C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0000020013069C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0000020014069C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0000020015069C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0000020017069C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0000020048085C'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0000020095013A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0000020102033A'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0000020106076C'.
#52#AO*  03  FILLER                 PIC X(14)  VALUE '0000020145000C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0000020152069C'.
PJG#AO*  03  FILLER                 PIC X(14)  VALUE '0000020173000C'.
#66#AP*  03  FILLER                 PIC X(14)  VALUE '0000020179000C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0000020181010C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0000020191069C'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0000020202081A'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0000020204076C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0000020207069C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0000020282069C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0000020309085C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0000020311069C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0000020312050C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0000020313069C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0000020314050C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0000020322069C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0000020366050C'.
PJG#D *  03  FILLER                 PIC X(14)  VALUE '0000020393076C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0000020394069C'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0000020417054A'.
         03  FILLER                 PIC X(14)  VALUE '0000020439068T'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0000020455069C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0000020456069C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0000020459069C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0000020486069C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0000020488085C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0000020498069C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0000020523085C'.
#79#AP*  03  FILLER                 PIC X(14)  VALUE '0000020528000C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0000020547069C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0000020548085C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0000020550069C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0000020628050C'.
#AH#AP*  03  FILLER                 PIC X(14)  VALUE '0000020633000C'.
         03  FILLER                 PIC X(14)  VALUE '0000020634068T'.
#89#AP*  03  FILLER                 PIC X(14)  VALUE '0000020668000C'.
#73#AP*  03  FILLER                 PIC X(14)  VALUE '0000020695000C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0000020749059C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0000020759085C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0000020794069C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0000020807069C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0000020855059C'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0000020880049A'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0000020982069C'.
#51#AO*  03  FILLER                 PIC X(14)  VALUE '0000021007000C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0000021083069C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0000021117069C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0000021147069C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0000021172069C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0000021205050C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0000021219069C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0000021312069C'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0000021332109A'.
#94#AP*  03  FILLER                 PIC X(14)  VALUE '0000021343000C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0000021359085C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0000021361085C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0000021365085C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0000021366085C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0000021369069C'.
         03  FILLER                 PIC X(14)  VALUE '0000021370041A'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0000021373085C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0000021377085C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0000021380085C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0000021382085C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0000021395085C'.
         03  FILLER                 PIC X(14)  VALUE '0000021407068T'.
#AI#AP*  03  FILLER                 PIC X(14)  VALUE '0000021417000C'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0000021503446A'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0000021517076C'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0000021551057A'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0000021587088C'.
#75#AO*  03  FILLER                 PIC X(14)  VALUE '0000021672000C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0000021709069C'.
#31#AO*  03  FILLER                 PIC X(14)  VALUE '0000021771000C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0000021803086C'.
#93#AP*  03  FILLER                 PIC X(14)  VALUE '0000021837000C'.
#79#AP*  03  FILLER                 PIC X(14)  VALUE '0000021869000C'.
PJG#AO*  03  FILLER                 PIC X(14)  VALUE '0000021880000C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0000021891069C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0000021893069C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0000021918069C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0000021919069C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0000021958069C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0000021960069C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0000021975069C'.
PJG#D *  03  FILLER                 PIC X(14)  VALUE '0000021976050C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0000022015069C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0000022020069C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0000022039069C'.
PJG#D *  03  FILLER                 PIC X(14)  VALUE '0000022063076C'.
PJG#D *  03  FILLER                 PIC X(14)  VALUE '0000022065056C'.
         03  FILLER                 PIC X(14)  VALUE '0000022070068T'.
         03  FILLER                 PIC X(14)  VALUE '0000022071068T'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0000022074867A'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0000022093069C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0000022095069C'.
#66#AO*  03  FILLER                 PIC X(14)  VALUE '0000022104000C'.
PJG#D *  03  FILLER                 PIC X(14)  VALUE '0000022122076C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0000022134069C'.
PJG#D *  03  FILLER                 PIC X(14)  VALUE '0000022138076C'.
#AI#AP*  03  FILLER                 PIC X(14)  VALUE '0000022142000C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0000022169069C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0000022170085C'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0000022176867A'.
         03  FILLER                 PIC X(14)  VALUE '0000022191068T'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0000022197069C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0000022202085C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0000022204085C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0000022232069C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0000022274069C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0000022290069C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0000022328069C'.
#56#AO*  03  FILLER                 PIC X(14)  VALUE '0000022343000C'.
PJG#AO*  03  FILLER                 PIC X(14)  VALUE '0000022348000C'.
         03  FILLER                 PIC X(14)  VALUE '0000022397068T'.
         03  FILLER                 PIC X(14)  VALUE '0000022398068T'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0000022433412A'.
PJG#D *  03  FILLER                 PIC X(14)  VALUE '0000022442050C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0000022444050C'.
PJG#D *  03  FILLER                 PIC X(14)  VALUE '0000022446080A'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0000022449089C'.
#44#AO*  03  FILLER                 PIC X(14)  VALUE '0000022459000C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0000022516069C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0000022526069C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0000022563069C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0000022584069C'.
#57#AO*  03  FILLER                 PIC X(14)  VALUE '0000022585000C'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0000022596043A'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0000022600069C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0000022611069C'.
         03  FILLER                 PIC X(14)  VALUE '0000022620068T'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0000022640069C'.
PJG#D *  03  FILLER                 PIC X(14)  VALUE '0000022705050C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0000022715069C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0000022767069C'.
#86#AP*  03  FILLER                 PIC X(14)  VALUE '0000022791000C'.
#59#AO*  03  FILLER                 PIC X(14)  VALUE '0000022827000C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0000022840069C'.
PJG#D *  03  FILLER                 PIC X(14)  VALUE '0000022841411C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0000022903069C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0000022942069C'.
#AJ#AP*  03  FILLER                 PIC X(14)  VALUE '0000022978000C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0000022982069C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0000022999085C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0000023006069C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0000023071069C'.
PJG#AO*  03  FILLER                 PIC X(14)  VALUE '0000023082010C'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0000023090052A'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0000023095085C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0000023100069C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0000023144090C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0000023148090C'.
         03  FILLER                 PIC X(14)  VALUE '0000023187026A'.
#97#AP*  03  FILLER                 PIC X(14)  VALUE '0000023224000C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0000023232085C'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0000023270867A'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0000023280059C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0000023308060C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0000023309060C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0000023310060C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0000023311060C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0000023312060C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0000023313060C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0000023314060C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0000023315060C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0000023316060C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0000023317060C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0000023318060C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0000023319060C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0000023320060C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0000023321060C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0000023322060C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0000023326060C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0000023327060C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0000023328060C'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0000023329058A'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0000023330060C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0000023331060C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0000023335060C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0000023336060C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0000023338060C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0000023341060C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0000023343060C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0000023360069C'.
         03  FILLER                 PIC X(14)  VALUE '0000023361068T'.
PJG#D *  03  FILLER                 PIC X(14)  VALUE '0000023364050C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0000023365069C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0000023366069C'.
#93#AP*  03  FILLER                 PIC X(14)  VALUE '0000023368000C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0000023376069C'.
         03  FILLER                 PIC X(14)  VALUE '0000023380068T'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0000023390076C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0000023392069C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0000023397069C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0000023399069C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0000023404069C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0000023409069C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0000023417069C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0000023427069C'.
#83#AP*  03  FILLER                 PIC X(14)  VALUE '0000023489000C'.
#AC#AN*  03  FILLER                 PIC X(14)  VALUE '0000023495000C'.
#AC#AN*  03  FILLER                 PIC X(14)  VALUE '0000023500000C'.
#AI#AN*  03  FILLER                 PIC X(14)  VALUE '0000023515000C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0000023541069C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0000023544069C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0000023553085C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0000023581069C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0000023630069C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0000023715059C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0000023734050C'.
#54#AP*  03  FILLER                 PIC X(14)  VALUE '0000023740000C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0000023747086C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0000023769085C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0000023800059C'.
#42#AP*  03  FILLER                 PIC X(14)  VALUE '0000023899000C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0000023900069C'.
PJG#D *  03  FILLER                 PIC X(14)  VALUE '0000023975056C'.
#75#AO*  03  FILLER                 PIC X(14)  VALUE '0000023983000C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0000023994059C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0000024001060C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0000024004060C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0000024006060C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0000024010060C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0000024011060C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0000024012060C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0000024014060C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0000024015060C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0000024019060C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0000024020060C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0000024022060C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0000024023060C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0000024026060C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0000024028060C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0000024030060C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0000024032060C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0000024033060C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0000024034060C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0000024035060C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0000024036060C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0000024037060C'.
#98#AP*  03  FILLER                 PIC X(14)  VALUE '0000024041000C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0000024043060C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0000024045060C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0000024048060C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0000024050060C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0000024051060C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0000024054060C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0000024058060C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0000024060060C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0000024065060C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0000024066060C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0000024067060C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0000024068060C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0000024069060C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0000024070060C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0000024071060C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0000024072060C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0000024074060C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0000024075069C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0000024076060C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0000024078060C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0000024080060C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0000024082060C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0000024086060C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0000024090060C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0000024093060C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0000024094060C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0000024095060C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0000024096060C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0000024097060C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0000024098060C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0000024127050C'.
#AC#AP*  03  FILLER                 PIC X(14)  VALUE '0000024149000C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0000024220060C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0000024235069C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0000024242069C'.
PJG#D *  03  FILLER                 PIC X(14)  VALUE '0000024243050C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0000024244050C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0000024245050C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0000024246069C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0000024256069C'.
PJG#D *  03  FILLER                 PIC X(14)  VALUE '0000024261076C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0000024264050C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0000024266050C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0000024272069C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0000024273050C'.
         03  FILLER                 PIC X(14)  VALUE '0000024301068T'.
         03  FILLER                 PIC X(14)  VALUE '0000024306068T'.
         03  FILLER                 PIC X(14)  VALUE '0000024308068T'.
         03  FILLER                 PIC X(14)  VALUE '0000024309068T'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0000024392085C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0000024397060C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0000024419060C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0000024420060C'.
         03  FILLER                 PIC X(14)  VALUE '0000024422068T'.
         03  FILLER                 PIC X(14)  VALUE '0000024423068T'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0000024428867A'.
PJG#AR*  03  FILLER                 PIC X(14)  VALUE '0000024429000A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0000024431867A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0000024432016A'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0000024477069C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0000024514069C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0000024558085C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0000024559085C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0000024560085C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0000024683085C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0000024770085C'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0000024790867A'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0000024815069C'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0000024837039A'.
PJG#D *  03  FILLER                 PIC X(14)  VALUE '0000024970064C'.
#72#AP*  03  FILLER                 PIC X(14)  VALUE '0000024992000C'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0000025500067A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0000025501431A'.
         03  FILLER                 PIC X(14)  VALUE '0000025502038A'.
         03  FILLER                 PIC X(14)  VALUE '0000025503432A'.
         03  FILLER                 PIC X(14)  VALUE '0000025504401A'.
         03  FILLER                 PIC X(14)  VALUE '0000025505407A'.
         03  FILLER                 PIC X(14)  VALUE '0000025506413A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0000025507436A'.
         03  FILLER                 PIC X(14)  VALUE '0000025508029A'.
         03  FILLER                 PIC X(14)  VALUE '0000025509013A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0000025510464A'.
         03  FILLER                 PIC X(14)  VALUE '0000025511016A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0000025512014A'.
         03  FILLER                 PIC X(14)  VALUE '0000025513447A'.
         03  FILLER                 PIC X(14)  VALUE '0000025514822A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0000025515109A'.
         03  FILLER                 PIC X(14)  VALUE '0000025516017A'.
         03  FILLER                 PIC X(14)  VALUE '0000025517052A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0000025518812A'.
         03  FILLER                 PIC X(14)  VALUE '0000025519425A'.
         03  FILLER                 PIC X(14)  VALUE '0000025520028A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0000025521113A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0000025522114A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0000025523115A'.
         03  FILLER                 PIC X(14)  VALUE '0000025524116A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0000025525439A'.
         03  FILLER                 PIC X(14)  VALUE '0000025526831A'.
         03  FILLER                 PIC X(14)  VALUE '0000025527823A'.
         03  FILLER                 PIC X(14)  VALUE '0000025528034A'.
         03  FILLER                 PIC X(14)  VALUE '0000025529493A'.
         03  FILLER                 PIC X(14)  VALUE '0000025530037A'.
         03  FILLER                 PIC X(14)  VALUE '0000025531071A'.
         03  FILLER                 PIC X(14)  VALUE '0000025532074A'.
         03  FILLER                 PIC X(14)  VALUE '0000025533440A'.
         03  FILLER                 PIC X(14)  VALUE '0000025534443A'.
         03  FILLER                 PIC X(14)  VALUE '0000025535408A'.
         03  FILLER                 PIC X(14)  VALUE '0000025536073A'.
         03  FILLER                 PIC X(14)  VALUE '0000025537058A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0000025538450A'.
         03  FILLER                 PIC X(14)  VALUE '0000025539498A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0000025540120A'.
         03  FILLER                 PIC X(14)  VALUE '0000025541070A'.
         03  FILLER                 PIC X(14)  VALUE '0000025542054A'.
         03  FILLER                 PIC X(14)  VALUE '0000025543821A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0000025544845A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0000025545049A'.
         03  FILLER                 PIC X(14)  VALUE '0000025546057A'.
         03  FILLER                 PIC X(14)  VALUE '0000025547850A'.
         03  FILLER                 PIC X(14)  VALUE '0000025548035A'.
         03  FILLER                 PIC X(14)  VALUE '0000025549452A'.
         03  FILLER                 PIC X(14)  VALUE '0000025550494A'.
         03  FILLER                 PIC X(14)  VALUE '0000025551482A'.
         03  FILLER                 PIC X(14)  VALUE '0000025552866A'.
         03  FILLER                 PIC X(14)  VALUE '0000025553868A'.
         03  FILLER                 PIC X(14)  VALUE '0000025554869A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0000025555870A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0000025563867A'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0000026284069C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0000026350085C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0000026386069C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0000026400085C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0000026423069C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0000026450085C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0000026478085C'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0000026479080A'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0000026499085C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0000026529085C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0000026531085C'.
         03  FILLER                 PIC X(14)  VALUE '0000026588068T'.
         03  FILLER                 PIC X(14)  VALUE '0000026595068T'.
PJG#K *#53 03  FILLER               PIC X(14)  VALUE '0000026617000C'.
#97#AP*  03  FILLER                 PIC X(14)  VALUE '0000026617000C'.
#79#AP*  03  FILLER                 PIC X(14)  VALUE '0000026623000C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0000026632069C'.
PJG#D *  03  FILLER                 PIC X(14)  VALUE '0000026741059C'.
PJG#D *  03  FILLER                 PIC X(14)  VALUE '0000026744056C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0000026754085C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0000026777090C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0000026795059C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0000026833086C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0000026840086C'.
#97#AP*  03  FILLER                 PIC X(14)  VALUE '0000026941000C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0000026992411C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0000027000069C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0000027050069C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0000028000069C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0000028001069C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0000028002085C'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0000028632839A'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0000030000069C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0000030001069C'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0000050189464A'.
PJG#AO*  03  FILLER                 PIC X(14)  VALUE '0000050531000C'.
PJG#D *  03  FILLER                 PIC X(14)  VALUE '0000050551069C'.
#55#AO*  03  FILLER                 PIC X(14)  VALUE '0000050607000C'.
#96#AP*  03  FILLER                 PIC X(14)  VALUE '0000050879000C'.
         03  FILLER                 PIC X(14)  VALUE '0000050947492A'.
PJG#D *  03  FILLER                 PIC X(14)  VALUE '0000051100064C'.
#52#AO*  03  FILLER                 PIC X(14)  VALUE '0000051104000C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0000051129085C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0000051325069C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0000051428069C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0000051429050C'.
#68#AP*  03  FILLER                 PIC X(14)  VALUE '0000051549000C'.
PJG#D *  03  FILLER                 PIC X(14)  VALUE '0000051607485C'.
         03  FILLER                 PIC X(14)  VALUE '0000051671495A'.
#46#AO*  03  FILLER                 PIC X(14)  VALUE '0000051685000C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0000051782069C'.
         03  FILLER                 PIC X(14)  VALUE '0000051783068T'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0000051815069C'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0000051999447A'.
         03  FILLER                 PIC X(14)  VALUE '0000052001068T'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0000052020069C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0000052028069C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0000052030069C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0000052031069C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0000052034050C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0000052039069C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0000052040069C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0000052046069C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0000052051069C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0000052054050C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0000052151069C'.
         03  FILLER                 PIC X(14)  VALUE '0000052496068T'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0000052500069C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0000052550069C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0000052596069C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0000052597069C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0000052598069C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0000052605069C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0000052631069C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0000052684485C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0000052735050C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0000052741069C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0000052753050C'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0000052851413A'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0000052900069C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0000053000069C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0000053005069C'.
#81#AP*  03  FILLER                 PIC X(14)  VALUE '0000053082000C'.
#AI#AO*  03  FILLER                 PIC X(14)  VALUE '0000053215000C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0000053260069C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0000053261069C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0000053263069C'.
#59#AP*  03  FILLER                 PIC X(14)  VALUE '0000059523000C'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0000060400498A'.
         03  FILLER                 PIC X(14)  VALUE '0000060950410A'.
PJG#D *  03  FILLER                 PIC X(14)  VALUE '0000061180485C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0000061411069C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0000061414069C'.
PJG#D *  03  FILLER                 PIC X(14)  VALUE '0000061922485C'.
PJG#D *  03  FILLER                 PIC X(14)  VALUE '0000061928485C'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0000061990482A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0000062008452A'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0000062009411C'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0000062011491A'.
         03  FILLER                 PIC X(14)  VALUE '0000062190068T'.
         03  FILLER                 PIC X(14)  VALUE '0000062191068T'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0000062192069C'.
         03  FILLER                 PIC X(14)  VALUE '0000062572890T'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0000063899050C'.
PJG#D *  03  FILLER                 PIC X(14)  VALUE '0000065265485C'.
PJG#D *  03  FILLER                 PIC X(14)  VALUE '0000066115485C'.
PJG#D *  03  FILLER                 PIC X(14)  VALUE '0000066128485C'.
PJG#D *  03  FILLER                 PIC X(14)  VALUE '0000066132485C'.
PJG#D *  03  FILLER                 PIC X(14)  VALUE '0000066134485C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0000066135069C'.
PJG#D *  03  FILLER                 PIC X(14)  VALUE '0000067813059C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0000068051069C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0000068755069C'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0000068888430A'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0000069578411C'.
PJG#D *  03  FILLER                 PIC X(14)  VALUE '0000069582411C'.
PJG#D *  03  FILLER                 PIC X(14)  VALUE '0000069583411C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0000069585411C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0000069586411C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0000069587411C'.
PJG#D *  03  FILLER                 PIC X(14)  VALUE '0000069588064C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0000069590411C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0000071671411C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0000072459485C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0000072464485C'.
         03  FILLER                 PIC X(14)  VALUE '0000072481068T'.
         03  FILLER                 PIC X(14)  VALUE '0000072486068T'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0000072493060C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0000072540085C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0000072547085C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0000072550085C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0000072554085C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0000072732050C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0000072737069C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0000072757069C'.
PJG#D *  03  FILLER                 PIC X(14)  VALUE '0000072849064C'.
PJG#D *  03  FILLER                 PIC X(14)  VALUE '0000072892485C'.
PJG#D *  03  FILLER                 PIC X(14)  VALUE '0000072902059C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0000073055069C'.
PJG#D *  03  FILLER                 PIC X(14)  VALUE '0000073146801C'.
PJG#D *  03  FILLER                 PIC X(14)  VALUE '0000073147801C'.
#AI#AP*  03  FILLER                 PIC X(14)  VALUE '0000073155000C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0000073162085C'.
#94#AP*  03  FILLER                 PIC X(14)  VALUE '0000073185000C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0000073310069C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0000073404085C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0000073459069C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0000073668069C'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0000073769452A'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0000074082085C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0000074115569C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0000074118569C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0000074223085C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0000074247069C'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0000074250491A'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0000074382069C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0000074456568C'.
         03  FILLER                 PIC X(14)  VALUE '0000074470867A'.
PJG#AR*  03  FILLER                 PIC X(14)  VALUE '0000074480000A'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0000074504085C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0000074976050C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0000075024069C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0000075116060C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0000075148060C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0000075155060C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0000075178060C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0000075181060C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0000075185060C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0000075186060C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0000075192060C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0000075198060C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0000075200060C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0000075201060C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0000075208060C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0000075219060C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0000075229060C'.
#92#AP*  03  FILLER                 PIC X(14)  VALUE '0000075300000C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0000075612069C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0000075661059C'.
#38#AP*  03  FILLER                 PIC X(14)  VALUE '0000076355000C'.
#90#AP*  03  FILLER                 PIC X(14)  VALUE '0000076453000C'.
#78#AP*  03  FILLER                 PIC X(14)  VALUE '0000076494000C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0000076562069C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0000076708069C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0000077007069C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0000077015069C'.
PJG#AO*  03  FILLER                 PIC X(14)  VALUE '0000077021000C'.
#89#AP*  03  FILLER                 PIC X(14)  VALUE '0000077036000C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0000077197069C'.
         03  FILLER                 PIC X(14)  VALUE '0000077205068T'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0000077396069C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0000077590069C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0000077604069C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0000077613085C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0000077991069C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0000078289050C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0000078470059C'.
#96#AP*  03  FILLER                 PIC X(14)  VALUE '0000078684000C'.
         03  FILLER                 PIC X(14)  VALUE '0000079152068T'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0000079309085C'.
         03  FILLER                 PIC X(14)  VALUE '0000079409068T'.
PJG#D *  03  FILLER                 PIC X(14)  VALUE '0000079456862C'.
#52#AO*  03  FILLER                 PIC X(14)  VALUE '0000079472000C'.
#70#AP*  03  FILLER                 PIC X(14)  VALUE '0000079589000C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0000079607085C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0000079624069C'.
         03  FILLER                 PIC X(14)  VALUE '0000079662068T'.
         03  FILLER                 PIC X(14)  VALUE '0000079684068T'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0000079724060C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0000079740060C'.
#75#AP*  03  FILLER                 PIC X(14)  VALUE '0000079761000C'.
#AE#AP*  03  FILLER                 PIC X(14)  VALUE '0000079848000C'.
         03  FILLER                 PIC X(14)  VALUE '0000080001068T'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0000080100804A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0000080200832A'.
#AB#AP*  03  FILLER                 PIC X(14)  VALUE '0000080223000C'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0000080250831A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0000080300824A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0000080400833A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0000080500823A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0000080600820A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0000080800839A'.
#67#AP*  03  FILLER                 PIC X(14)  VALUE '0000080817000C'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0000080900845A'.
#54#AP*  03  FILLER                 PIC X(14)  VALUE '0000080906000C'.
#54#AO*  03  FILLER                 PIC X(14)  VALUE '0000080936000C'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0000081000819A'.
#AI#AP*  03  FILLER                 PIC X(14)  VALUE '0000081049000C'.
         03  FILLER                 PIC X(14)  VALUE '0000081696085U'.
         03  FILLER                 PIC X(14)  VALUE '0000081699085V'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0000082000069C'.
PJG#D *  03  FILLER                 PIC X(14)  VALUE '0000082974000C'.
#97#AP*  03  FILLER                 PIC X(14)  VALUE '0000083576000C'.
PJG#AO*  03  FILLER                 PIC X(14)  VALUE '0000083897000C'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0000084000822A'.
         03  FILLER                 PIC X(14)  VALUE '0000084100805A'.
#92#AP*  03  FILLER                 PIC X(14)  VALUE '0000084185000C'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0000084200821A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0000084400848A'.
#96#AP*  03  FILLER                 PIC X(14)  VALUE '0000084503000C'.
#AC#AP*  03  FILLER                 PIC X(14)  VALUE '0000084553000C'.
PJG#AO*  03  FILLER                 PIC X(14)  VALUE '0000084556000C'.
#45#AO*  03  FILLER                 PIC X(14)  VALUE '0000084952000C'.
#96#AP*  03  FILLER                 PIC X(14)  VALUE '0000084982000C'.
PJG#K *  03  FILLER                 PIC X(14)  VALUE '0000084988000C'.
PJG#AR*  03  FILLER                 PIC X(14)  VALUE '0000085192000A'.
PJG#AR*  03  FILLER                 PIC X(14)  VALUE '0000085193000A'.
PJG#AR*  03  FILLER                 PIC X(14)  VALUE '0000085196000A'.
#97#AP*  03  FILLER                 PIC X(14)  VALUE '0000085386000C'.
#82#AP*  03  FILLER                 PIC X(14)  VALUE '0000085518000C'.
#70#AP*  03  FILLER                 PIC X(14)  VALUE '0000086016000C'.
#97#AP*  03  FILLER                 PIC X(14)  VALUE '0000086033000C'.
#59#AP*  03  FILLER                 PIC X(14)  VALUE '0000086283000C'.
#92#AP*  03  FILLER                 PIC X(14)  VALUE '0000086364000C'.
#30#AO*  03  FILLER                 PIC X(14)  VALUE '0000086401000C'.
PJG#AO*  03  FILLER                 PIC X(14)  VALUE '0000086941000C'.
#AI#AN*  03  FILLER                 PIC X(14)  VALUE '0000087001000C'.
#54#AO*  03  FILLER                 PIC X(14)  VALUE '0000088058000C'.
PJG#I    03  FILLER                 PIC X(14)  VALUE '0000088075000A'.
PJG#I    03  FILLER                 PIC X(14)  VALUE '0000088077000A'.
PJG#AR*  03  FILLER                 PIC X(14)  VALUE '0000088087000A'.
PJG#I    03  FILLER                 PIC X(14)  VALUE '0000088089000A'.
PJG#AR*  03  FILLER                 PIC X(14)  VALUE '0000088096000A'.
PJG#I    03  FILLER                 PIC X(14)  VALUE '0000088101000A'.
PJG#I    03  FILLER                 PIC X(14)  VALUE '0000088102000A'.
PJG#I    03  FILLER                 PIC X(14)  VALUE '0000088105000A'.
PJG#I    03  FILLER                 PIC X(14)  VALUE '0000088110000A'.
PJG#I    03  FILLER                 PIC X(14)  VALUE '0000088118000A'.
PJG#AR*  03  FILLER                 PIC X(14)  VALUE '0000088123000A'.
PJG#I    03  FILLER                 PIC X(14)  VALUE '0000088125000A'.
PJG#AR*  03  FILLER                 PIC X(14)  VALUE '0000088126000A'.
PJG#AR*  03  FILLER                 PIC X(14)  VALUE '0000088131000A'.
PJG#I    03  FILLER                 PIC X(14)  VALUE '0000088133000A'.
PJG#AR*  03  FILLER                 PIC X(14)  VALUE '0000088139000A'.
PJG#AR*  03  FILLER                 PIC X(14)  VALUE '0000088142000A'.
PJG#AR*  03  FILLER                 PIC X(14)  VALUE '0000088145000A'.
PJG#I    03  FILLER                 PIC X(14)  VALUE '0000088146000A'.
PJG#I    03  FILLER                 PIC X(14)  VALUE '0000088152000A'.
PJG#I    03  FILLER                 PIC X(14)  VALUE '0000088157000A'.
PJG#I    03  FILLER                 PIC X(14)  VALUE '0000088158000A'.
PJG#I    03  FILLER                 PIC X(14)  VALUE '0000088162000A'.
PJG#I    03  FILLER                 PIC X(14)  VALUE '0000088164000A'.
PJG#AR*  03  FILLER                 PIC X(14)  VALUE '0000088165000A'.
PJG#I    03  FILLER                 PIC X(14)  VALUE '0000088166000A'.
PJG#I    03  FILLER                 PIC X(14)  VALUE '0000088168000A'.
PJG#I    03  FILLER                 PIC X(14)  VALUE '0000088187000A'.
PJG#I    03  FILLER                 PIC X(14)  VALUE '0000088198000A'.
PJG#I    03  FILLER                 PIC X(14)  VALUE '0000088202000A'.
PJG#AR*  03  FILLER                 PIC X(14)  VALUE '0000088203000A'.
PJG#I    03  FILLER                 PIC X(14)  VALUE '0000088207000A'.
PJG#I    03  FILLER                 PIC X(14)  VALUE '0000088213000A'.
PJG#I    03  FILLER                 PIC X(14)  VALUE '0000088221000A'.
PJG#I    03  FILLER                 PIC X(14)  VALUE '0000088223000A'.
PJG#I    03  FILLER                 PIC X(14)  VALUE '0000088225000A'.
PJG#AR*  03  FILLER                 PIC X(14)  VALUE '0000088228000A'.
PJG#AR*  03  FILLER                 PIC X(14)  VALUE '0000088229000A'.
PJG#I    03  FILLER                 PIC X(14)  VALUE '0000088234000A'.
PJG#I    03  FILLER                 PIC X(14)  VALUE '0000088242000A'.
PJG#I    03  FILLER                 PIC X(14)  VALUE '0000088243000A'.
PJG#AR*  03  FILLER                 PIC X(14)  VALUE '0000088246000A'.
PJG#I    03  FILLER                 PIC X(14)  VALUE '0000088252000A'.
PJG#I    03  FILLER                 PIC X(14)  VALUE '0000088262000A'.
PJG#I    03  FILLER                 PIC X(14)  VALUE '0000088263000A'.
PJG#I    03  FILLER                 PIC X(14)  VALUE '0000088264000A'.
PJG#AR*  03  FILLER                 PIC X(14)  VALUE '0000088272000A'.
PJG#AR*  03  FILLER                 PIC X(14)  VALUE '0000088277000A'.
PJG#I    03  FILLER                 PIC X(14)  VALUE '0000088279000A'.
PJG#AR*  03  FILLER                 PIC X(14)  VALUE '0000088299000A'.
PJG#I    03  FILLER                 PIC X(14)  VALUE '0000088305000A'.
PJG#I    03  FILLER                 PIC X(14)  VALUE '0000088321000A'.
PJG#I    03  FILLER                 PIC X(14)  VALUE '0000088322000A'.
PJG#AR*  03  FILLER                 PIC X(14)  VALUE '0000088325000A'.
PJG#I    03  FILLER                 PIC X(14)  VALUE '0000088332000A'.
PJG#AR*  03  FILLER                 PIC X(14)  VALUE '0000088334000A'.
PJG#I    03  FILLER                 PIC X(14)  VALUE '0000088335000A'.
PJG#I    03  FILLER                 PIC X(14)  VALUE '0000088344000A'.
PJG#I    03  FILLER                 PIC X(14)  VALUE '0000088347000A'.
PJG#I    03  FILLER                 PIC X(14)  VALUE '0000088372000A'.
PJG#AR*  03  FILLER                 PIC X(14)  VALUE '0000088373000A'.
PJG#I    03  FILLER                 PIC X(14)  VALUE '0000088374000A'.
PJG#I    03  FILLER                 PIC X(14)  VALUE '0000088377000A'.
PJG#AR*  03  FILLER                 PIC X(14)  VALUE '0000088380000A'.
PJG#AR*  03  FILLER                 PIC X(14)  VALUE '0000088394000A'.
#75#AO*  03  FILLER                 PIC X(14)  VALUE '0000088552000C'.
#82#AP*  03  FILLER                 PIC X(14)  VALUE '0000088583000C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0000088591050C'.
#65#AP*  03  FILLER                 PIC X(14)  VALUE '0000088672000C'.
#72#AP*  03  FILLER                 PIC X(14)  VALUE '0000088770000C'.
PJG#AR*  03  FILLER                 PIC X(14)  VALUE '0000088800000A'.
PJG#AR*  03  FILLER                 PIC X(14)  VALUE '0000088810000A'.
PJG#AR*  03  FILLER                 PIC X(14)  VALUE '0000088811000A'.
PJG#I    03  FILLER                 PIC X(14)  VALUE '0000088814000A'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0000088918069C'.
PJG#I    03  FILLER                 PIC X(14)  VALUE '0000088992000A'.
#AI#AP*  03  FILLER                 PIC X(14)  VALUE '0000089183000C'.
#79#AP*  03  FILLER                 PIC X(14)  VALUE '0000089279000C'.
PJG#H *#AP 03 FILLER                PIC X(14)  VALUE '0000089498000C'.
#50#AO*  03  FILLER                 PIC X(14)  VALUE '0000089499000C'.
#40#AP*  03  FILLER                 PIC X(14)  VALUE '0000089518000C'.
#82#AP*  03  FILLER                 PIC X(14)  VALUE '0000089555000C'.
#60#AP*  03  FILLER                 PIC X(14)  VALUE '0000089710000C'.
#37#AO*  03  FILLER                 PIC X(14)  VALUE '0000089759000C'.
#49#AP*  03  FILLER                 PIC X(14)  VALUE '0000089800000C'.
#89#AP*  03  FILLER                 PIC X(14)  VALUE '0000089875000C'.
#77#AP*  03  FILLER                 PIC X(14)  VALUE '0000090804000C'.
#67#AO*  03  FILLER                 PIC X(14)  VALUE '0000090819000C'.
#93#AP*  03  FILLER                 PIC X(14)  VALUE '0000091231000C'.
#95#AP*  03  FILLER                 PIC X(14)  VALUE '0000092132000C'.
#78#AO*  03  FILLER                 PIC X(14)  VALUE '0000092553000C'.
#97#AP*  03  FILLER                 PIC X(14)  VALUE '0000093474000C'.
PJG#D *  03  FILLER                 PIC X(14)  VALUE '0000093511000C'.
PJG#AO*  03  FILLER                 PIC X(14)  VALUE '0000093678000C'.
#59#AP*  03  FILLER                 PIC X(14)  VALUE '0000093887000C'.
#AG#AP*  03  FILLER                 PIC X(14)  VALUE '0000094161000C'.
#75#AO*  03  FILLER                 PIC X(14)  VALUE '0000094179000C'.
#96#AP*  03  FILLER                 PIC X(14)  VALUE '0000094300000C'.
PJG#AO*  03  FILLER                 PIC X(14)  VALUE '0000094434000C'.
#52#AO*  03  FILLER                 PIC X(14)  VALUE '0000094513000C'.
#57#AO*  03  FILLER                 PIC X(14)  VALUE '0000094830000C'.
#86#AP*  03  FILLER                 PIC X(14)  VALUE '0000094834000C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0000094874069C'.
PJG#AO*  03  FILLER                 PIC X(14)  VALUE '0000095041000C'.
#AJ#AP*  03  FILLER                 PIC X(14)  VALUE '0000095043000C'.
#96#AP*  03  FILLER                 PIC X(14)  VALUE '0000095057000C'.
#20#AO*  03  FILLER                 PIC X(14)  VALUE '0000095225000C'.
#75#AP*  03  FILLER                 PIC X(14)  VALUE '0000095246000C'.
#55#AP*  03  FILLER                 PIC X(14)  VALUE '0000095258000C'.
#54#AP*  03  FILLER                 PIC X(14)  VALUE '0000095262000C'.
#75#AP*  03  FILLER                 PIC X(14)  VALUE '0000095273000C'.
#54#AO*  03  FILLER                 PIC X(14)  VALUE '0000095359000C'.
#93#AP*  03  FILLER                 PIC X(14)  VALUE '0000095376000C'.
#79#AP*  03  FILLER                 PIC X(14)  VALUE '0000095395000C'.
#AM#AP*  03  FILLER                 PIC X(14)  VALUE '0000095396000C'.
#AC#AN*  03  FILLER                 PIC X(14)  VALUE '0000095397000C'.
#64#AO*  03  FILLER                 PIC X(14)  VALUE '0000095439000C'.
#75#AP*  03  FILLER                 PIC X(14)  VALUE '0000095505000C'.
#75#AO*  03  FILLER                 PIC X(14)  VALUE '0000095524000C'.
#92#AP*  03  FILLER                 PIC X(14)  VALUE '0000095528000C'.
#72#AO*  03  FILLER                 PIC X(14)  VALUE '0000095685000C'.
#92#AP*  03  FILLER                 PIC X(14)  VALUE '0000095749000C'.
#AI#AN*  03  FILLER                 PIC X(14)  VALUE '0000095762000C'.
#AC#AP*  03  FILLER                 PIC X(14)  VALUE '0000095764000C'.
#97#AP*  03  FILLER                 PIC X(14)  VALUE '0000095778000C'.
#AH#AP*  03  FILLER                 PIC X(14)  VALUE '0000095862000C'.
#74#AP*  03  FILLER                 PIC X(14)  VALUE '0000096444000C'.
#88#AP*  03  FILLER                 PIC X(14)  VALUE '0000096619000C'.
#AF#AP*  03  FILLER                 PIC X(14)  VALUE '0000096672000C'.
#AH#AP*  03  FILLER                 PIC X(14)  VALUE '0000096949000C'.
#55#AO*  03  FILLER                 PIC X(14)  VALUE '0000098477000C'.
#AD#AP*  03  FILLER                 PIC X(14)  VALUE '0000098550000C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0001000004085C'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0001007671867A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0001008377870A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0001009800869A'.
#AI#AP*  03  FILLER                 PIC X(14)  VALUE '0001033930000C'.
#AI#AP*  03  FILLER                 PIC X(14)  VALUE '0001034015000C'.
#AI#AP*  03  FILLER                 PIC X(14)  VALUE '0001034063000C'.
PJG#D *  03  FILLER                 PIC X(14)  VALUE '0001034527603C'.
PJG#D *  03  FILLER                 PIC X(14)  VALUE '0001034529602C'.
PJG#D *  03  FILLER                 PIC X(14)  VALUE '0001034551602C'.
PJG#D *  03  FILLER                 PIC X(14)  VALUE '0001037837601C'.
PJG#D *  03  FILLER                 PIC X(14)  VALUE '0001037838601C'.
PJG#D *  03  FILLER                 PIC X(14)  VALUE '0001037840603C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0001037841603C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0001037843601C'.
#95#AP*  03  FILLER                 PIC X(14)  VALUE '0001071492000C'.
#99#AP*  03  FILLER                 PIC X(14)  VALUE '0001079777000C'.
PJG#D *  03  FILLER                 PIC X(14)  VALUE '0001111706000C'.
#93#AP*  03  FILLER                 PIC X(14)  VALUE '0001140208000C'.
#44#AO*  03  FILLER                 PIC X(14)  VALUE '0001145797000C'.
PJG#AO*  03  FILLER                 PIC X(14)  VALUE '0001156648000C'.
#30#AP*  03  FILLER                 PIC X(14)  VALUE '0001407048000C'.
PJG#AO*  03  FILLER                 PIC X(14)  VALUE '0001420867000C'.
#80#AP*  03  FILLER                 PIC X(14)  VALUE '0001439680000C'.
#81#AP*  03  FILLER                 PIC X(14)  VALUE '0001442812000C'.
#35#AO*  03  FILLER                 PIC X(14)  VALUE '0001530476000C'.
#77#AP*  03  FILLER                 PIC X(14)  VALUE '0001585354000C'.
#94#AP*  03  FILLER                 PIC X(14)  VALUE '0001662065000C'.
PJG#M *#AP 03 FILLER                PIC X(14)  VALUE '0001663308000C'.
#67#AP*  03  FILLER                 PIC X(14)  VALUE '0001699570000C'.
#AF#AP*  03  FILLER                 PIC X(14)  VALUE '0001717775000C'.
#70#AO*  03  FILLER                 PIC X(14)  VALUE '0001718356000C'.
#93#AP*  03  FILLER                 PIC X(14)  VALUE '0001804254000C'.
#89#AP*  03  FILLER                 PIC X(14)  VALUE '0001871991000C'.
#44#AO*  03  FILLER                 PIC X(14)  VALUE '0001877701000C'.
#AC#AP*  03  FILLER                 PIC X(14)  VALUE '0001912319000C'.
#AI#AP*  03  FILLER                 PIC X(14)  VALUE '0001931253000C'.
#60#AO*  03  FILLER                 PIC X(14)  VALUE '0001934913000C'.
PJG#AO*  03  FILLER                 PIC X(14)  VALUE '0001941558000C'.
#52#AO*  03  FILLER                 PIC X(14)  VALUE '0001946666000C'.
#75#AO*  03  FILLER                 PIC X(14)  VALUE '0001948215000C'.
#77#AP*  03  FILLER                 PIC X(14)  VALUE '0001958130000C'.
#87#AP*  03  FILLER                 PIC X(14)  VALUE '0001992136000C'.
#92#AP*  03  FILLER                 PIC X(14)  VALUE '0001993147000C'.
#72#AP*  03  FILLER                 PIC X(14)  VALUE '0002000290000C'.
PJG#AO*  03  FILLER                 PIC X(14)  VALUE '0002000362000C'.
#AH#AP*  03  FILLER                 PIC X(14)  VALUE '0002001066000C'.
#52#AO*  03  FILLER                 PIC X(14)  VALUE '0002001824000C'.
PJG#L *#53 03  FILLER               PIC X(14)  VALUE '0002002229000C'.
#97#AP*  03  FILLER                 PIC X(14)  VALUE '0002002229000C'.
#97#AP*  03  FILLER                 PIC X(14)  VALUE '0002003125000C'.
#31#AP*  03  FILLER                 PIC X(14)  VALUE '0002003731000C'.
#71#AO*  03  FILLER                 PIC X(14)  VALUE '0002005753000C'.
#96#AP*  03  FILLER                 PIC X(14)  VALUE '0002005868000C'.
#97#AP*  03  FILLER                 PIC X(14)  VALUE '0002006887000C'.
#54#AO*  03  FILLER                 PIC X(14)  VALUE '0002008540000C'.
#31#AO*  03  FILLER                 PIC X(14)  VALUE '0002010085000C'.
PJG#AO*  03  FILLER                 PIC X(14)  VALUE '0002011010000C'.
#AJ#AP*  03  FILLER                 PIC X(14)  VALUE '0002011731000C'.
#72#AO*  03  FILLER                 PIC X(14)  VALUE '0002012814000C'.
#94#AP*  03  FILLER                 PIC X(14)  VALUE '0002013307000C'.
#92#AP*  03  FILLER                 PIC X(14)  VALUE '0002015580000C'.
#AF#AP*  03  FILLER                 PIC X(14)  VALUE '0002017279000C'.
#96#AP*  03  FILLER                 PIC X(14)  VALUE '0002990002000C'.
#96#AP*  03  FILLER                 PIC X(14)  VALUE '0002990005000C'.
#31#AO*  03  FILLER                 PIC X(14)  VALUE '0002991355000C'.
#30#AP*  03  FILLER                 PIC X(14)  VALUE '0002999743000C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0003003569050C'.
#76#AO*  03  FILLER                 PIC X(14)  VALUE '0003004068000C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0003004562050C'.
#AI#AN*  03  FILLER                 PIC X(14)  VALUE '0003008993000C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0004000000087C'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0004232017114A'.
PJG#A *  03  FILLER                 PIC X(14)  VALUE '00043*****086C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0004444444085C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0004553344085C'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0004678201821A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005000025038A'.
#72#AO*  03  FILLER                 PIC X(14)  VALUE '0005000247000C'.
#69#AP*  03  FILLER                 PIC X(14)  VALUE '0005000391000C'.
PJG#AO*  03  FILLER                 PIC X(14)  VALUE '0005000418000C'.
#AH#AP*  03  FILLER                 PIC X(14)  VALUE '0005001406000C'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005001709452A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005001900822A'.
#97#AP*  03  FILLER                 PIC X(14)  VALUE '0005002282000C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0005003000801C'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005003024013A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005003026037A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005003031832A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005003044029A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005003046450A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005003049038A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005003052866A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005003053870A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005003068407A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005003070413A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005003071443A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005003075017A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005003077439A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005003084013A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005003086017A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005003088446A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005003095038A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005003096074A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005003109494A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005003118037A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005003121014A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005003122401A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005003134114A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005003137029A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005003138410A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005003139821A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005003143042A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005003147073A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005003153868A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005003159115A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005003161035A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005003168058A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005003169016A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005003170446A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005003180067A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005003182074A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005003185839A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005003186450A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005003187452A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005003194116A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005003198845A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005003205823A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005003208870A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005003212070A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005003217074A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005003221440A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005003222450A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005003223482A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005003224407A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005003225447A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005003228431A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005003230868A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005003233831A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005003237052A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005003238804A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005003239071A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005003240868A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005003244820A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005003245870A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005003247822A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005003249868A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005003251401A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005003252432A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005003253408A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005003254494A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005003257493A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005003258494A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005003262867A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005003265446A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005003268823A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005003269120A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005003272850A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005003275070A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005003276850A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005003283866A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005003286115A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005003287866A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005003288401A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005003295052A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005003297034A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005003301482A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005003302431A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005003305113A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005003314831A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005003315831A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005003316868A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005003318832A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005003319464A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005003323408A'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0005003326561C'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005003328430A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005003329071A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005003330016A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005003334113A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005003335067A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005003336033A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005003337029A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005003338035A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005003339067A'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0005003340801C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0005003341801C'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005003346035A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005003347109A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005003348410A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005003354016A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005003355028A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005003357104A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005003358113A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005003359016A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005003361057A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005003363028A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005003375014A'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0005003377860C'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005003379498A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005003380447A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005003381067A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005003382034A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005003385440A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005003387054A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005003388104A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005003389016A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005003391823A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005003392804A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005003393114A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005003400496A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005003401073A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005003402057A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005003403820A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005003406116A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005003407035A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005003408413A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005003411869A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005003413052A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005003415819A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005003418054A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005003419866A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005003420867A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005003421436A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005003423845A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005003424407A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005003425482A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005003426867A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005003427452A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005003429113A'.
PJG#D *  03  FILLER                 PIC X(14)  VALUE '0005003433458C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0005003436122C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0005003437567C'.
PJG#D *  03  FILLER                 PIC X(14)  VALUE '0005003439458C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0005003440562C'.
PJG#D *  03  FILLER                 PIC X(14)  VALUE '0005003442458C'.
PJG#D *  03  FILLER                 PIC X(14)  VALUE '0005003445458C'.
PJG#D *  03  FILLER                 PIC X(14)  VALUE '0005003448458C'.
PJG#D *  03  FILLER                 PIC X(14)  VALUE '0005003451458C'.
PJG#D *  03  FILLER                 PIC X(14)  VALUE '0005003454458C'.
PJG#D *  03  FILLER                 PIC X(14)  VALUE '0005003457122C'.
PJG#D *  03  FILLER                 PIC X(14)  VALUE '0005003463122C'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005003466073A'.
PJG#D *  03  FILLER                 PIC X(14)  VALUE '0005003469862C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0005003470565C'.
PJG#D *  03  FILLER                 PIC X(14)  VALUE '0005003472862C'.
PJG#D *  03  FILLER                 PIC X(14)  VALUE '0005003475861C'.
PJG#D *  03  FILLER                 PIC X(14)  VALUE '0005003478122C'.
PJG#D *  03  FILLER                 PIC X(14)  VALUE '0005003481862C'.
PJG#D *  03  FILLER                 PIC X(14)  VALUE '0005003484861C'.
PJG#D *  03  FILLER                 PIC X(14)  VALUE '0005003487862C'.
PJG#D *  03  FILLER                 PIC X(14)  VALUE '0005003490862C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0005003491570C'.
PJG#D *  03  FILLER                 PIC X(14)  VALUE '0005003493862C'.
PJG#D *  03  FILLER                 PIC X(14)  VALUE '0005003496862C'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005004014016A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005004134850A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005004606870A'.
PJG#AO*  03  FILLER                 PIC X(14)  VALUE '0005004694000C'.
#78#AP*  03  FILLER                 PIC X(14)  VALUE '0005004798000C'.
#AI#AN*  03  FILLER                 PIC X(14)  VALUE '0005004905000C'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005005231867A'.
#90#AP*  03  FILLER                 PIC X(14)  VALUE '0005005777000C'.
PJG#D *  03  FILLER                 PIC X(14)  VALUE '0005005967114A'.
#71#AO*  03  FILLER                 PIC X(14)  VALUE '0005006293000C'.
#89#AP*  03  FILLER                 PIC X(14)  VALUE '0005006605000C'.
PJG#AO*  03  FILLER                 PIC X(14)  VALUE '0005006727000C'.
PJG#AO*  03  FILLER                 PIC X(14)  VALUE '0005006842000C'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005006877867A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005007065867A'.
PJG#AO*  03  FILLER                 PIC X(14)  VALUE '0005007099000C'.
#57#AP*  03  FILLER                 PIC X(14)  VALUE '0005007181000C'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005007243870A'.
#42#AO*  03  FILLER                 PIC X(14)  VALUE '0005007304000C'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005007355081A'.
#69#AP*  03  FILLER                 PIC X(14)  VALUE '0005007800000C'.
#AA#AP*  03  FILLER                 PIC X(14)  VALUE '0005007941000C'.
#82#AP*  03  FILLER                 PIC X(14)  VALUE '0005007975000C'.
PJG#AO*  03  FILLER                 PIC X(14)  VALUE '0005007981000C'.
#95#AP*  03  FILLER                 PIC X(14)  VALUE '0005008031000C'.
PJG#D *  03  FILLER                 PIC X(14)  VALUE '0005008130000C'.
PJG#AO*  03  FILLER                 PIC X(14)  VALUE '0005008068000C'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005008291080A'.
#80#AP*  03  FILLER                 PIC X(14)  VALUE '0005008312000C'.
#56#AO*  03  FILLER                 PIC X(14)  VALUE '0005008319000C'.
#69#AP*  03  FILLER                 PIC X(14)  VALUE '0005008344000C'.
#AC#AP*  03  FILLER                 PIC X(14)  VALUE '0005008443000C'.
#44#AO*  03  FILLER                 PIC X(14)  VALUE '0005008454000C'.
#93#AP*  03  FILLER                 PIC X(14)  VALUE '0005008528000C'.
#54#AO*  03  FILLER                 PIC X(14)  VALUE '0005008555000C'.
PJG#AO*  03  FILLER                 PIC X(14)  VALUE '0005008721000C'.
PJG#G *#AP 03 FILLER                PIC X(14)  VALUE '0005008726000C'.
#AI#AP*  03  FILLER                 PIC X(14)  VALUE '0005008771000C'.
#33#AO*  03  FILLER                 PIC X(14)  VALUE '0005008822000C'.
#93#AP*  03  FILLER                 PIC X(14)  VALUE '0005010307000C'.
#47#AO*  03  FILLER                 PIC X(14)  VALUE '0005011243000C'.
PJG#AO*  03  FILLER                 PIC X(14)  VALUE '0005011347000C'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005011419495A'.
PJG#H *#AP 03 FILLER                PIC X(14)  VALUE '0005011469000C'.
#90#AP*  03  FILLER                 PIC X(14)  VALUE '0005011565000C'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005012005866A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005012008867A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005012014867A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005012018867A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005012019866A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005012029868A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005012030868A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005012032850A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005012033850A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005012034071A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005012035071A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005012040104A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005012041073A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005012043074A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005012049067A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005012050067A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005012051067A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005012054109A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005012055035A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005012056109A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005012057109A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005012058034A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005012060034A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005012062054A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005012063035A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005012068034A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005012069070A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005012071070A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005012074038A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005012075038A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005012076038A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005012077038A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005012078038A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005012083057A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005012084037A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005012085037A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005012086037A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005012087028A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005012088028A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005012089028A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005012091028A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005012092028A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005012095067A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005012096067A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005012100822A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005012101822A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005012102822A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005012104822A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005012105822A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005012106822A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005012107823A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005012110823A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005012111823A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005012112823A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005012113823A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005012117820A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005012119820A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005012123824A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005012124824A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005012127820A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005012129819A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005012130819A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005012131819A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005012133831A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005012135831A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005012136831A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005012139831A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005012140831A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005012141833A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005012142819A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005012143804A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005012145804A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005012146804A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005012147804A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005012148804A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005012152804A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005012153804A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005012154845A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005012156839A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005012157839A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005012159839A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005012162821A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005012164016A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005012166016A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005012168016A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005012169016A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005012171016A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005012172016A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005012173016A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005012174016A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005012175017A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005012177016A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005012178016A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005012179016A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005012180017A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005012181115A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005012182016A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005012183114A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005012185425A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005012186425A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005012187425A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005012190425A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005012191425A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005012192425A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005012193115A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005012194425A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005012195425A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005012196425A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005012197431A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005012198401A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005012201401A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005012202016A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005012203401A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005012205401A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005012206401A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005012208014A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005012210014A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005012211013A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005012212013A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005012213014A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005012214013A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005012215013A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005012216067A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005012217013A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005012219116A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005012220116A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005012221116A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005012223116A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005012224446A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005012225114A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005012226446A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005012227446A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005012229114A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005012230446A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005012231016A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005012232114A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005012233446A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005012235446A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005012236446A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005012237114A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005012238446A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005012239446A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005012240114A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005012241446A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005012242446A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005012243446A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005012245446A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005012247446A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005012251013A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005012252446A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005012255014A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005012256073A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005012259104A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005012262867A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005012265035A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005012266821A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005012267452A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005012269440A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005012270067A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005012271408A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005012273822A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005012274452A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005012275452A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005012276038A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005012280034A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005012281850A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005012282823A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005012283439A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005012501066A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005012502073A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005012503073A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005012504868A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005012505867A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005012506867A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005012507850A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005012509866A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005012512867A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005012513867A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005012514867A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005012515866A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005012516867A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005012517867A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005012518867A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005012519866A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005012520866A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005012521867A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005012522868A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005012523868A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005012524870A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005012525850A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005012526071A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005012527071A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005012528071A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005012529071A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005012530074A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005012531074A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005012532120A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005012533074A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005012534850A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005012535067A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005012536035A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005012537035A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005012538109A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005012539034A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005012540054A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005012541034A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005012542034A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005012543070A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005012544038A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005012545038A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005012546039A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005012547039A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005012548054A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005012549057A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005012550037A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005012551028A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005012552028A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005012553113A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005012555030A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005012556839A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005012557839A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005012558839A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005012559839A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005012560804A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005012561822A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005012562822A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005012563822A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005012564823A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005012565823A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005012566823A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005012567823A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005012568823A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005012570832A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005012571832A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005012572820A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005012573819A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005012574820A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005012575831A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005012576831A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005012577831A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005012578845A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005012579804A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005012580845A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005012581821A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005012582821A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005012583823A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005012584431A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005012585401A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005012586014A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005012587016A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005012588013A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005012589016A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005012591014A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005012592017A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005012593016A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005012594115A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005012595425A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005012596013A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005012597446A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005012598114A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005012599014A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005012600016A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005012601016A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005012602114A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005012603446A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005012604013A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005012605016A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005012606446A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005012607425A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005012608446A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005012613867A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005012618867A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005012620868A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005012621868A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005012623850A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005012624850A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005012625070A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005012627120A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005012629028A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005012630071A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005012631038A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005012632057A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005012633070A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005012636867A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005012639016A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005012640016A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005012641013A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005012643017A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005012644017A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005012645116A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005012646017A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005012648867A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005012649054A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005012650845A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005012651821A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005012653037A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005012654034A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005012655071A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005012656049A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005012662867A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005012663071A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005012664049A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005012665058A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005012666052A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005012667052A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005012668823A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005012669821A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005012670028A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005012671052A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005012672073A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005012673070A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005012674016A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005012675850A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005012676823A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005012679038A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005012681037A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005012682052A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005012683052A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005012684052A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005012685052A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005012686052A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005012687052A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005012688052A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005012689052A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005012690052A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005012691052A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005012692868A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005012693049A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005012694049A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005012697049A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005012698049A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005012699049A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005012700049A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005012701049A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005012702049A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005012703049A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005012706058A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005012707058A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005012708058A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005012709058A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005012711058A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005012714868A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005012718028A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005013002432A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005013008407A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005013009407A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005013010407A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005013014413A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005013015413A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005013016413A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005013017436A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005013018436A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005013019436A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005013020436A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005013029413A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005013030410A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005013035410A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005013040450A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005013042450A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005013043450A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005013046439A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005013057493A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005013059440A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005013063447A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005013067443A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005013068443A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005013070443A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005013077494A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005013078494A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005013082452A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005013084452A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005013085452A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005013086452A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005013088452A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005013089452A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005013090452A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005013093452A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005013095493A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005013097452A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005013099482A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005013100447A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005013102450A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005013103407A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005013104494A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005013106452A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005013108493A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005013111452A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005013112482A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005013113498A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005013114494A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005013116494A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005013123452A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005013124452A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005013125443A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005013126452A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005013127408A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005013128440A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005013129498A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005013130452A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005013501432A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005013502432A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005013503407A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005013504407A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005013505413A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005013506464A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005013507464A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005013508408A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005013509408A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005013511413A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005013512410A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005013513450A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005013514439A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005013515493A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005013516440A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005013517447A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005013518443A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005013519443A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005013520482A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005013521482A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005013522452A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005013523452A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005013524452A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005013525452A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005013526452A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005013527452A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005013528493A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005013529494A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005013530494A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005013531407A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005013532498A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005013534494A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005013535450A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005013536493A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005013539452A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005013540482A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005013541029A'.
PJG#D *  03  FILLER                 PIC X(14)  VALUE '0005033001122C'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005033004867A'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0005033005564C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0005033007862C'.
PJG#D *  03  FILLER                 PIC X(14)  VALUE '0005033010862C'.
PJG#D *  03  FILLER                 PIC X(14)  VALUE '0005033013862C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0005033014571C'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005033017014A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005033018425A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005033019039A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005033020038A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005033021058A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005033022867A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005033024070A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005033025869A'.
PJG#D *  03  FILLER                 PIC X(14)  VALUE '0005033026122C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0005033027566C'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005033029464A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005033030070A'.
PJG#D *  03  FILLER                 PIC X(14)  VALUE '0005033031560C'.
PJG#D *  03  FILLER                 PIC X(14)  VALUE '0005033032862C'.
PJG#D *  03  FILLER                 PIC X(14)  VALUE '0005033033862C'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005033034493A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005033035870A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005033046432A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005033047410A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005033048014A'.
PJG#D *  03  FILLER                 PIC X(14)  VALUE '0005033049862C'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005033053850A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005033054446A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005033055804A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005033056866A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005033057432A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005033058028A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005033059016A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005033060493A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005033061071A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005033063821A'.
PJG#D *  03  FILLER                 PIC X(14)  VALUE '0005033064458C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0005033065563C'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005033067439A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0005033068113A'.
PJG#D *  03  FILLER                 PIC X(14)  VALUE '0005033069862C'.
PJG#D *  03  FILLER                 PIC X(14)  VALUE '0005033070862C'.
PJG#D *  03  FILLER                 PIC X(14)  VALUE '0005033071862C'.
PJG#D *  03  FILLER                 PIC X(14)  VALUE '0005033072862C'.
PJG#D *  03  FILLER                 PIC X(14)  VALUE '0005033073862C'.
PJG#D *  03  FILLER                 PIC X(14)  VALUE '0005033074862C'.
PJG#D *  03  FILLER                 PIC X(14)  VALUE '0005033075862C'.
PJG#D *  03  FILLER                 PIC X(14)  VALUE '0005033076862C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0005555555085C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0006000001085C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0006000004085C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0006000005085C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0006000007085C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0006000008085C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0006000010085C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0006000011085C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0006000012085C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0006000013085C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0006000014085C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0006000015085C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0006000016085C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0006000017085C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0006000018085C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0006000019085C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0006000020085C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0006000021085C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0006000022085C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0006000023085C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0006000024085C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0006000025085C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0006000026085C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0006000027085C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0006000028085C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0006000029085C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0006000030085C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0006000031085C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0006000032085C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0006000033085C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0006000034085C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0006000035085C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0006000036085C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0006000037085C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0006000038085C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0006000039085C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0006000040085C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0006000041085C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0006000042085C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0006000043085C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0006000044085C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0006000045085C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0006000046085C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0006000047085C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0006000048050C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0006000049085C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0006000050085C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0006000051085C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0006000052085C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0006000053085C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0006000054085C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0006000055085C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0006000056085C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0006000057085C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0006000058085C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0006000059085C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0006000060085C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0006000061085C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0006000062085C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0006000063085C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0006000064085C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0006000065085C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0006000066085C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0006000068085C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0006000069085C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0006000070085C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0006000071085C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0006000072085C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0006000073085C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0006000074085C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0006000075085C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0006000076085C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0006000077085C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0006000078085C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0006000079085C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0006000080085C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0006000081085C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0006000082085C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0006000083085C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0006000084085C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0006000085085C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0006000086085C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0006000087085C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0006000088085C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0006000089085C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0006000090085C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0006000091085C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0006000092085C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0006000093085C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0006000094085C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0006000095085C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0006000096085C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0006000099085C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0006000103085C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0006000104085C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0006000105085C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0006000106085C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0006000107085C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0006000108085C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0006000109085C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0006000110085C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0006000111085C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0006000112085C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0006000113085C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0006000114085C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0006000115085C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0006000116085C'.
PJG#D *  03  FILLER                 PIC X(14)  VALUE '0006000168860C'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0006006003867A'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0006666666085C'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0007000564073A'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0007003000085C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0007003001085C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0007003002090C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0007003003085C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0007003004090C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0007003005085C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0007003006085C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0007003007085C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0007003008085C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0007003010085C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0007003011085C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0007003012085C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0007003024050C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0007003025050C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0007003026085C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0007003027086C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0007003028085C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0007003030085C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0007003031085C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0007003033085C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0007003034085C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0007003037085C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0007003038085C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0007003039085C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0007003041085C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0007003042085C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0007003043085C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0007003045085C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0007003054085C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0007003061085C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0007003065085C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0007003069085C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0007003071085C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0007003073085C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0007003074085C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0007003075085C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0007003077085C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0007003078085C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0007003079085C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0007003080085C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0007003081085C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0007003082085C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0007003083085C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0007003084085C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0007003085085C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0007003086085C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0007003087085C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0007003088085C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0007003089085C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0007003090085C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0007003091085C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0007003092085C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0007003093085C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0007003094085C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0007003095085C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0007003096085C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0007003097085C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0007003098085C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0007003099085C'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0007004550870A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0007004802867A'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0007004903085C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0007004904056C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0007004909411C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0007005001050C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0007005002090C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0007005003090C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0007005004090C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0007005005090C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0007005006050C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0007005007050C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0007005009090C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0007005010050C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0007005011050C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0007005013050C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0007005028050C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0007005029050C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0007005031050C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0007005034050C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0007005035050C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0007005036050C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0007005037050C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0007005038050C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0007005039050C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0007005042050C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0007005099090C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0007005100090C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0007005105090C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0007005108050C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0007005110090C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0007005111090C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0007005114090C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0007005117090C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0007005118090C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0007005120090C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0007005121090C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0007005122050C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0007005123050C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0007005124090C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0007005126050C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0007005129085C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0007005130085C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0007005131050C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0007005132050C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0007005134085C'.
         03  FILLER                 PIC X(14)  VALUE '0007005135452A'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0007005138050C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0007005139050C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0007005142090C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0007005143050C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0007005144050C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0007005150050C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0007005207085C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0007005212090C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0007005222090C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0007005230050C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0007005237090C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0007005239090C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0007005240090C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0007005241090C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0007005242090C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0007005243090C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0007005244090C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0007005245090C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0007005250085C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0007005333085C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0007005334085C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0007005512085C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0007005513085C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0007005515085C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0007005516085C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0007005590085C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0007005607050C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0007005608050C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0007005609050C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0007005613050C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0007005619050C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0007005633050C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0007005664050C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0007005671050C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0007005679050C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0007005686050C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0007005687059C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0007005688050C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0007005699085C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0007005702050C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0007005704050C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0007005706050C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0007005707050C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0007005712050C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0007005722050C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0007005728050C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0007005745050C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0007005746050C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0007005751050C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0007005789050C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0007005801050C'.
PJG#I *  03  FILLER                 PIC X(14)  VALUE '0007005802050C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0007005805050C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0007005806050C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0007005808050C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0007005809050C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0007005812050C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0007005813050C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0007005815050C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0007005817050C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0007006666050C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0007007002050C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0007007003050C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0007007004050C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0007007005085C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0007007008050C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0007007011050C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0007007012085C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0007007013085C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0007007014085C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0007007015085C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0007007019085C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0007007021050C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0007007022050C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0007007023050C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0007007029085C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0007007030085C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0007007031085C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0007007032085C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0007007033085C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0007007034085C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0007007037085C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0007007041085C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0007007042085C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0007007044085C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0007007045085C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0007007046085C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0007007047085C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0007007049085C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0007007050085C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0007007052085C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0007007053085C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0007007055085C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0007007056085C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0007007064085C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0007007072085C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0007007077085C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0007007079085C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0007007085085C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0007007089085C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0007007090085C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0007007092085C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0007007097050C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0007007098085C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0007007099085C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0007009003050C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0007009007050C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0007009999050C'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0007015070867A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0007015270867A'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0007015279056C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0007015289076C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0007015321056C'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0007020361839A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0007023637867A'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0007025001050C'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0007030933401A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0007047655867A'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0007060000050C'.
PJG#D *  03  FILLER                 PIC X(14)  VALUE '0007060449000C'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0007061096868A'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0007080030050C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0007080115411C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0007080125085C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0007080126050C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0007080130085C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0007080143050C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0007084507085C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0007084513085C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0007100000090C'.
         03  FILLER                 PIC X(14)  VALUE '0007100174890T'.
         03  FILLER                 PIC X(14)  VALUE '0007100742890T'.
         03  FILLER                 PIC X(14)  VALUE '0007200000890T'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0007300051050C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0007300052050C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0007300053050C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0007300055050C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0007300056050C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0007300057050C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0007300066050C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0007300095050C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0007300105050C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0007300116050C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0007300120050C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0007300124050C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0007300132050C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0007300134050C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0007300137050C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0007300138050C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0007300141050C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0007300144050C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0007300163050C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0007300165050C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0007300170050C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0007300178050C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0007300204050C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0007300212050C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0007300227050C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0007300229050C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0007300233050C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0007300245050C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0007300272050C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0007300287050C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0007300298050C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0007300303050C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0007300312050C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0007300322050C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0007300324050C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0007300328050C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0007300384050C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0007300410050C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0007300423050C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0007300432050C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0007300433050C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0007300441050C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0007300461050C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0007300465050C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0007300471050C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0007300488050C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0007300510050C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0007300512050C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0007300514050C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0007300520050C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0007300524050C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0007300534050C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0007300584050C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0007300586050C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0007300587050C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0007300588050C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0007300589050C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0007300619050C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0007300626050C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0007300640050C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0007500003085C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0007660000050C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0007660003085C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0007660010085C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0007660011801C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0007660012085C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0007660016050C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0007660018085C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0007660019890C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0007660022085C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0007660027050C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0007660063050C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0007660199085C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0007660934050C'.
         03  FILLER                 PIC X(14)  VALUE '0007662000890T'.
         03  FILLER                 PIC X(14)  VALUE '0007662001890T'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0007700001085C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0007700002085C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0007700003085C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0007700004085C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0007700005085C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0007700006085C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0007700007085C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0007700008085C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0007700009085C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0007700010085C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0007700011085C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0007700012085C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0007700013085C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0007700014085C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0007700015085C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0007700016085C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0007700017085C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0007700018085C'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0007800035452A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0007800050821A'.
PJG#D *  03  FILLER                 PIC X(14)  VALUE '0007800072069C'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0007800080067A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0007800081067A'.
PJG#D *  03  FILLER                 PIC X(14)  VALUE '0007800087099C'.
PJG#I    03  FILLER                 PIC X(14)  VALUE '0007800087000A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0007800093867A'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0007800099085C'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0007800100067A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0007800200067A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0007800299067A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0007801081431A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0007801100431A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0007801200431A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0007801299431A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0007803080038A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0007803100038A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0007803200038A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0007803299038A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0007804099432A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0007804100432A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0007804200432A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0007804299432A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0007805001401A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0007805003401A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0007805080401A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0007805100401A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0007805200401A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0007805299401A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0007806100804A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0007806200804A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0007806299804A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0007807100104A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0007807200104A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0007807299104A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0007808002407A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0007808080407A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0007808099407A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0007808100407A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0007808200407A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0007808299407A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0007809099413A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0007809100413A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0007809200413A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0007809299413A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0007810099436A'.
         03  FILLER                 PIC X(14)  VALUE '0007810100436A'.
         03  FILLER                 PIC X(14)  VALUE '0007810200436A'.
         03  FILLER                 PIC X(14)  VALUE '0007810299436A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0007811001036A'.
         03  FILLER                 PIC X(14)  VALUE '0007811100029A'.
         03  FILLER                 PIC X(14)  VALUE '0007811200029A'.
         03  FILLER                 PIC X(14)  VALUE '0007811299029A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0007812080013A'.
         03  FILLER                 PIC X(14)  VALUE '0007812100013A'.
         03  FILLER                 PIC X(14)  VALUE '0007812200013A'.
         03  FILLER                 PIC X(14)  VALUE '0007812299013A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0007813099464A'.
         03  FILLER                 PIC X(14)  VALUE '0007813100464A'.
         03  FILLER                 PIC X(14)  VALUE '0007813200464A'.
         03  FILLER                 PIC X(14)  VALUE '0007813299464A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0007814000016A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0007814002016A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0007814003016A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0007814080016A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0007814100016A'.
         03  FILLER                 PIC X(14)  VALUE '0007814200016A'.
         03  FILLER                 PIC X(14)  VALUE '0007814299016A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0007815100014A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0007815200014A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0007815299014A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0007816001832A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0007816002832A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0007816003832A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0007816005832A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0007816006832A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0007816007832A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0007816008832A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0007816009832A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0007816100832A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0007816200832A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0007816299832A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0007817080819A'.
         03  FILLER                 PIC X(14)  VALUE '0007817100819A'.
         03  FILLER                 PIC X(14)  VALUE '0007817200819A'.
         03  FILLER                 PIC X(14)  VALUE '0007817299819A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0007818080447A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0007818099447A'.
         03  FILLER                 PIC X(14)  VALUE '0007818100447A'.
         03  FILLER                 PIC X(14)  VALUE '0007818200447A'.
         03  FILLER                 PIC X(14)  VALUE '0007818299447A'.
         03  FILLER                 PIC X(14)  VALUE '0007819100822A'.
         03  FILLER                 PIC X(14)  VALUE '0007819200822A'.
         03  FILLER                 PIC X(14)  VALUE '0007819299822A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0007820080109A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0007820100109A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0007820200109A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0007820299109A'.
         03  FILLER                 PIC X(14)  VALUE '0007821100017A'.
         03  FILLER                 PIC X(14)  VALUE '0007821200017A'.
         03  FILLER                 PIC X(14)  VALUE '0007821299017A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0007822001052A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0007822003052A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0007822004052A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0007822005052A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0007822100052A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0007822200052A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0007822299052A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0007822901052A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0007823002839A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0007823080812A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0007823100812A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0007823200812A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0007823299812A'.
         03  FILLER                 PIC X(14)  VALUE '0007824100425A'.
         03  FILLER                 PIC X(14)  VALUE '0007824200425A'.
         03  FILLER                 PIC X(14)  VALUE '0007824299425A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0007825001028A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0007825080028A'.
         03  FILLER                 PIC X(14)  VALUE '0007825100028A'.
         03  FILLER                 PIC X(14)  VALUE '0007825200028A'.
         03  FILLER                 PIC X(14)  VALUE '0007825299028A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0007826080113A'.
         03  FILLER                 PIC X(14)  VALUE '0007826100113A'.
         03  FILLER                 PIC X(14)  VALUE '0007826200113A'.
         03  FILLER                 PIC X(14)  VALUE '0007826299113A'.
         03  FILLER                 PIC X(14)  VALUE '0007828100114A'.
         03  FILLER                 PIC X(14)  VALUE '0007828200114A'.
         03  FILLER                 PIC X(14)  VALUE '0007828299114A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0007829080115A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0007829100115A'.
         03  FILLER                 PIC X(14)  VALUE '0007829200115A'.
         03  FILLER                 PIC X(14)  VALUE '0007829299115A'.
         03  FILLER                 PIC X(14)  VALUE '0007831100116A'.
         03  FILLER                 PIC X(14)  VALUE '0007831200116A'.
         03  FILLER                 PIC X(14)  VALUE '0007831299116A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0007832080439A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0007832099439A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0007832100439A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0007832200439A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0007832299439A'.
         03  FILLER                 PIC X(14)  VALUE '0007833100831A'.
         03  FILLER                 PIC X(14)  VALUE '0007833200831A'.
         03  FILLER                 PIC X(14)  VALUE '0007833299831A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0007834001823A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0007834080823A'.
         03  FILLER                 PIC X(14)  VALUE '0007834100823A'.
         03  FILLER                 PIC X(14)  VALUE '0007834200823A'.
         03  FILLER                 PIC X(14)  VALUE '0007834299823A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0007835000452A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0007835080452A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0007835100452A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0007835200452A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0007835299452A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0007837001034A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0007837080034A'.
         03  FILLER                 PIC X(14)  VALUE '0007837100034A'.
         03  FILLER                 PIC X(14)  VALUE '0007837200034A'.
         03  FILLER                 PIC X(14)  VALUE '0007837299034A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0007838080493A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0007838099431A'.
         03  FILLER                 PIC X(14)  VALUE '0007838100493A'.
         03  FILLER                 PIC X(14)  VALUE '0007838200493A'.
         03  FILLER                 PIC X(14)  VALUE '0007838299493A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0007840080037A'.
         03  FILLER                 PIC X(14)  VALUE '0007840100037A'.
         03  FILLER                 PIC X(14)  VALUE '0007840200037A'.
         03  FILLER                 PIC X(14)  VALUE '0007840299037A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0007841080071A'.
         03  FILLER                 PIC X(14)  VALUE '0007841100071A'.
         03  FILLER                 PIC X(14)  VALUE '0007841200071A'.
         03  FILLER                 PIC X(14)  VALUE '0007841299071A'.
         03  FILLER                 PIC X(14)  VALUE '0007843100074A'.
         03  FILLER                 PIC X(14)  VALUE '0007843200074A'.
         03  FILLER                 PIC X(14)  VALUE '0007843299074A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0007844099440A'.
         03  FILLER                 PIC X(14)  VALUE '0007844100440A'.
         03  FILLER                 PIC X(14)  VALUE '0007844200440A'.
         03  FILLER                 PIC X(14)  VALUE '0007844299440A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0007845099443A'.
         03  FILLER                 PIC X(14)  VALUE '0007845100443A'.
         03  FILLER                 PIC X(14)  VALUE '0007845200443A'.
         03  FILLER                 PIC X(14)  VALUE '0007845299443A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0007846080446A'.
         03  FILLER                 PIC X(14)  VALUE '0007846100446A'.
         03  FILLER                 PIC X(14)  VALUE '0007846200446A'.
         03  FILLER                 PIC X(14)  VALUE '0007846299446A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0007847099407A'.
         03  FILLER                 PIC X(14)  VALUE '0007847100408A'.
         03  FILLER                 PIC X(14)  VALUE '0007847200408A'.
         03  FILLER                 PIC X(14)  VALUE '0007847299408A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0007848000073A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0007848080073A'.
         03  FILLER                 PIC X(14)  VALUE '0007848100073A'.
         03  FILLER                 PIC X(14)  VALUE '0007848200073A'.
         03  FILLER                 PIC X(14)  VALUE '0007848299073A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0007849100058A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0007849200058A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0007849299058A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0007851099410A'.
         03  FILLER                 PIC X(14)  VALUE '0007851100410A'.
         03  FILLER                 PIC X(14)  VALUE '0007851200410A'.
         03  FILLER                 PIC X(14)  VALUE '0007851299410A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0007852080450A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0007852099450A'.
         03  FILLER                 PIC X(14)  VALUE '0007852100450A'.
         03  FILLER                 PIC X(14)  VALUE '0007852200450A'.
         03  FILLER                 PIC X(14)  VALUE '0007852299450A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0007853099498A'.
         03  FILLER                 PIC X(14)  VALUE '0007853100498A'.
         03  FILLER                 PIC X(14)  VALUE '0007853200498A'.
         03  FILLER                 PIC X(14)  VALUE '0007853299498A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0007854002120A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0007854100120A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0007854200120A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0007854299120A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0007855080070A'.
         03  FILLER                 PIC X(14)  VALUE '0007855100070A'.
         03  FILLER                 PIC X(14)  VALUE '0007855200070A'.
         03  FILLER                 PIC X(14)  VALUE '0007855299070A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0007856100054A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0007856200054A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0007856299054A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0007857080821A'.
         03  FILLER                 PIC X(14)  VALUE '0007857100821A'.
         03  FILLER                 PIC X(14)  VALUE '0007857200821A'.
         03  FILLER                 PIC X(14)  VALUE '0007857299821A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0007858001845A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0007858100845A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0007858200845A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0007858299845A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0007859100049A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0007859200049A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0007859299049A'.
         03  FILLER                 PIC X(14)  VALUE '0007860100057A'.
         03  FILLER                 PIC X(14)  VALUE '0007860200057A'.
         03  FILLER                 PIC X(14)  VALUE '0007860299057A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0007861080850A'.
         03  FILLER                 PIC X(14)  VALUE '0007861100850A'.
         03  FILLER                 PIC X(14)  VALUE '0007861200850A'.
         03  FILLER                 PIC X(14)  VALUE '0007861299850A'.
         03  FILLER                 PIC X(14)  VALUE '0007862100035A'.
         03  FILLER                 PIC X(14)  VALUE '0007862200035A'.
         03  FILLER                 PIC X(14)  VALUE '0007862299035A'.
         03  FILLER                 PIC X(14)  VALUE '0007865100820A'.
         03  FILLER                 PIC X(14)  VALUE '0007865200820A'.
         03  FILLER                 PIC X(14)  VALUE '0007865299820A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0007871080452A'.
         03  FILLER                 PIC X(14)  VALUE '0007871100452A'.
         03  FILLER                 PIC X(14)  VALUE '0007871200452A'.
         03  FILLER                 PIC X(14)  VALUE '0007871299452A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0007873099494A'.
         03  FILLER                 PIC X(14)  VALUE '0007873100494A'.
         03  FILLER                 PIC X(14)  VALUE '0007873200494A'.
         03  FILLER                 PIC X(14)  VALUE '0007873299494A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0007874080482A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0007874099482A'.
         03  FILLER                 PIC X(14)  VALUE '0007874100482A'.
         03  FILLER                 PIC X(14)  VALUE '0007874200482A'.
         03  FILLER                 PIC X(14)  VALUE '0007874299482A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0007891099866A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0007891100866A'.
         03  FILLER                 PIC X(14)  VALUE '0007891200866A'.
         03  FILLER                 PIC X(14)  VALUE '0007891299866A'.
PJG#D *  03  FILLER                 PIC X(14)  VALUE '0007892080085C'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0007892099867A'.
         03  FILLER                 PIC X(14)  VALUE '0007892100867A'.
         03  FILLER                 PIC X(14)  VALUE '0007892200867A'.
         03  FILLER                 PIC X(14)  VALUE '0007892299867A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0007895001868A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0007895002868A'.
   #AR*  03  FILLER                 PIC X(14)  VALUE '0007895080868A'.
         03  FILLER                 PIC X(14)  VALUE '0007895100868A'.
         03  FILLER                 PIC X(14)  VALUE '0007895200868A'.
         03  FILLER                 PIC X(14)  VALUE '0007895299868A'.
         03  FILLER                 PIC X(14)  VALUE '0007897100869A'.
         03  FILLER                 PIC X(14)  VALUE '0007897200869A'.
         03  FILLER                 PIC X(14)  VALUE '0007897299869A'.
         03  FILLER                 PIC X(14)  VALUE '0007898100870A'.
         03  FILLER                 PIC X(14)  VALUE '0007898200870A'.
         03  FILLER                 PIC X(14)  VALUE '0007898299870A'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0007899081085C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0007899082085C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0007899100090C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0007899200090C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0007899299090C'.
PJG#D *  03  FILLER                 PIC X(14)  VALUE '0008000001458C'.
PJG#D *  03  FILLER                 PIC X(14)  VALUE '0008000002122C'.
PJG#D *  03  FILLER                 PIC X(14)  VALUE '0008000003861C'.
PJG#D *  03  FILLER                 PIC X(14)  VALUE '0008000004862C'.
PJG#I    03  FILLER                 PIC X(14)  VALUE '0008000005000A'.
PJG#2 *  03  FILLER                 PIC X(14)  VALUE '0008010063537C'.
PJG#2 *  03  FILLER                 PIC X(14)  VALUE '0008010106537C'.
PJG#2 *  03  FILLER                 PIC X(14)  VALUE '0008010251537C'.
PJG#2 *  03  FILLER                 PIC X(14)  VALUE '0008010278537C'.
PJG#2 *  03  FILLER                 PIC X(14)  VALUE '0008010292537C'.
PJG#2 *  03  FILLER                 PIC X(14)  VALUE '0008010326537C'.
PJG#2 *  03  FILLER                 PIC X(14)  VALUE '0008010346537C'.
PJG#2 *  03  FILLER                 PIC X(14)  VALUE '0008010373537C'.
PJG#2 *  03  FILLER                 PIC X(14)  VALUE '0008010514537C'.
PJG#2 *  03  FILLER                 PIC X(14)  VALUE '0008010551537C'.
PJG#2 *  03  FILLER                 PIC X(14)  VALUE '0008012168537C'.
PJG#2 *  03  FILLER                 PIC X(14)  VALUE '0008012174537C'.
PJG#2 *  03  FILLER                 PIC X(14)  VALUE '0008012176537C'.
PJG#2    03  FILLER                 PIC X(14)  VALUE '000801****537G'.
PJG#D *  03  FILLER                 PIC X(14)  VALUE '0008033000561C'.
PJG#2    03  FILLER                 PIC X(14)  VALUE '000811****537G'.
PJG#D *  03  FILLER                 PIC X(14)  VALUE '0008711400287C'.
PJG#D *  03  FILLER                 PIC X(14)  VALUE '0008800000860C'.
PJG#I    03  FILLER                 PIC X(14)  VALUE '0009000332000A'.
PJG#I    03  FILLER                 PIC X(14)  VALUE '0009004658000A'.
PJG#I    03  FILLER                 PIC X(14)  VALUE '0009006157000A'.
PJG#I    03  FILLER                 PIC X(14)  VALUE '0009006463000A'.
PJG#AR*  03  FILLER                 PIC X(14)  VALUE '0009006867000A'.
PJG#AR*  03  FILLER                 PIC X(14)  VALUE '0009007010000A'.
PJG#I    03  FILLER                 PIC X(14)  VALUE '0009007069000A'.
PJG#AR*  03  FILLER                 PIC X(14)  VALUE '0009007496000A'.
PJG#AR*  03  FILLER                 PIC X(14)  VALUE '0009007653000A'.
PJG#I    03  FILLER                 PIC X(14)  VALUE '0009010002000A'.
PJG#AR*  03  FILLER                 PIC X(14)  VALUE '0009010003000A'.
PJG#AR*  03  FILLER                 PIC X(14)  VALUE '0009020008000A'.
PJG#AR*  03  FILLER                 PIC X(14)  VALUE '0009020102000A'.
PJG#I    03  FILLER                 PIC X(14)  VALUE '0009021370000A'.
PJG#I    03  FILLER                 PIC X(14)  VALUE '0009023187000A'.
PJG#AR*  03  FILLER                 PIC X(14)  VALUE '0009024428000A'.
PJG#I    03  FILLER                 PIC X(14)  VALUE '0009025503000A'.
PJG#AR*  03  FILLER                 PIC X(14)  VALUE '0009025515000A'.
PJG#AR*  03  FILLER                 PIC X(14)  VALUE '0009025521000A'.
PJG#I    03  FILLER                 PIC X(14)  VALUE '0009025523000A'.
PJG#AR*  03  FILLER                 PIC X(14)  VALUE '0009025525000A'.
PJG#I    03  FILLER                 PIC X(14)  VALUE '0009025531000A'.
PJG#I    03  FILLER                 PIC X(14)  VALUE '0009025539000A'.
PJG#AR*  03  FILLER                 PIC X(14)  VALUE '0009025540000A'.
PJG#I    03  FILLER                 PIC X(14)  VALUE '0009025543000A'.
PJG#AR*  03  FILLER                 PIC X(14)  VALUE '0009025544000A'.
PJG#I    03  FILLER                 PIC X(14)  VALUE '0009025552000A'.
PJG#I    03  FILLER                 PIC X(14)  VALUE '0009025553000A'.
PJG#I    03  FILLER                 PIC X(14)  VALUE '0009025554000A'.
PJG#AR*  03  FILLER                 PIC X(14)  VALUE '0009025555000A'.
PJG#AR*  03  FILLER                 PIC X(14)  VALUE '0009030003000A'.
PJG#I    03  FILLER                 PIC X(14)  VALUE '0009040009000A'.
PJG#I    03  FILLER                 PIC X(14)  VALUE '0009050005000A'.
PJG#I    03  FILLER                 PIC X(14)  VALUE '0009060018000A'.
PJG#I    03  FILLER                 PIC X(14)  VALUE '0009074470000A'.
PJG#AR*  03  FILLER                 PIC X(14)  VALUE '0009080300000A'.
PJG#AR*  03  FILLER                 PIC X(14)  VALUE '0009080400000A'.
PJG#AR*  03  FILLER                 PIC X(14)  VALUE '0009080800000A'.
PJG#AR*  03  FILLER                 PIC X(14)  VALUE '0009084400000A'.
PJG#I    03  FILLER                 PIC X(14)  VALUE '0009088075000A'.
PJG#I    03  FILLER                 PIC X(14)  VALUE '0009088077000A'.
PJG#AR*  03  FILLER                 PIC X(14)  VALUE '0009088087000A'.
PJG#I    03  FILLER                 PIC X(14)  VALUE '0009088089000A'.
PJG#AR*  03  FILLER                 PIC X(14)  VALUE '0009088096000A'.
PJG#I    03  FILLER                 PIC X(14)  VALUE '0009088101000A'.
PJG#I    03  FILLER                 PIC X(14)  VALUE '0009088102000A'.
PJG#I    03  FILLER                 PIC X(14)  VALUE '0009088105000A'.
PJG#I    03  FILLER                 PIC X(14)  VALUE '0009088110000A'.
PJG#I    03  FILLER                 PIC X(14)  VALUE '0009088118000A'.
PJG#AR*  03  FILLER                 PIC X(14)  VALUE '0009088123000A'.
PJG#I    03  FILLER                 PIC X(14)  VALUE '0009088125000A'.
PJG#I    03  FILLER                 PIC X(14)  VALUE '0009088146000A'.
PJG#I    03  FILLER                 PIC X(14)  VALUE '0009088152000A'.
PJG#I    03  FILLER                 PIC X(14)  VALUE '0009088157000A'.
PJG#I    03  FILLER                 PIC X(14)  VALUE '0009088158000A'.
PJG#I    03  FILLER                 PIC X(14)  VALUE '0009088164000A'.
PJG#AR*  03  FILLER                 PIC X(14)  VALUE '0009088165000A'.
PJG#I    03  FILLER                 PIC X(14)  VALUE '0009088166000A'.
PJG#I    03  FILLER                 PIC X(14)  VALUE '0009088168000A'.
PJG#I    03  FILLER                 PIC X(14)  VALUE '0009088173000A'.
PJG#I    03  FILLER                 PIC X(14)  VALUE '0009088187000A'.
PJG#I    03  FILLER                 PIC X(14)  VALUE '0009088198000A'.
PJG#I    03  FILLER                 PIC X(14)  VALUE '0009088202000A'.
PJG#AR*  03  FILLER                 PIC X(14)  VALUE '0009088203000A'.
PJG#I    03  FILLER                 PIC X(14)  VALUE '0009088207000A'.
PJG#I    03  FILLER                 PIC X(14)  VALUE '0009088213000A'.
PJG#I    03  FILLER                 PIC X(14)  VALUE '0009088221000A'.
PJG#I    03  FILLER                 PIC X(14)  VALUE '0009088223000A'.
PJG#I    03  FILLER                 PIC X(14)  VALUE '0009088225000A'.
PJG#AR*  03  FILLER                 PIC X(14)  VALUE '0009088228000A'.
PJG#AR*  03  FILLER                 PIC X(14)  VALUE '0009088229000A'.
PJG#I    03  FILLER                 PIC X(14)  VALUE '0009088234000A'.
PJG#I    03  FILLER                 PIC X(14)  VALUE '0009088242000A'.
PJG#I    03  FILLER                 PIC X(14)  VALUE '0009088243000A'.
PJG#AR*  03  FILLER                 PIC X(14)  VALUE '0009088246000A'.
PJG#I    03  FILLER                 PIC X(14)  VALUE '0009088252000A'.
PJG#I    03  FILLER                 PIC X(14)  VALUE '0009088262000A'.
PJG#I    03  FILLER                 PIC X(14)  VALUE '0009088263000A'.
PJG#I    03  FILLER                 PIC X(14)  VALUE '0009088264000A'.
PJG#AR*  03  FILLER                 PIC X(14)  VALUE '0009088272000A'.
PJG#AR*  03  FILLER                 PIC X(14)  VALUE '0009088277000A'.
PJG#I    03  FILLER                 PIC X(14)  VALUE '0009088279000A'.
PJG#AR*  03  FILLER                 PIC X(14)  VALUE '0009088299000A'.
PJG#I    03  FILLER                 PIC X(14)  VALUE '0009088305000A'.
PJG#I    03  FILLER                 PIC X(14)  VALUE '0009088321000A'.
PJG#I    03  FILLER                 PIC X(14)  VALUE '0009088322000A'.
PJG#AR*  03  FILLER                 PIC X(14)  VALUE '0009088325000A'.
PJG#I    03  FILLER                 PIC X(14)  VALUE '0009088332000A'.
PJG#AR*  03  FILLER                 PIC X(14)  VALUE '0009088334000A'.
PJG#I    03  FILLER                 PIC X(14)  VALUE '0009088335000A'.
PJG#AR*  03  FILLER                 PIC X(14)  VALUE '0009088344000A'.
PJG#I    03  FILLER                 PIC X(14)  VALUE '0009088347000A'.
PJG#AR*  03  FILLER                 PIC X(14)  VALUE '0009088356000A'.
PJG#I    03  FILLER                 PIC X(14)  VALUE '0009088374000A'.
PJG#I    03  FILLER                 PIC X(14)  VALUE '0009088377000A'.
PJG#AR*  03  FILLER                 PIC X(14)  VALUE '0009088394000A'.
PJG#AR*  03  FILLER                 PIC X(14)  VALUE '0009088800000A'.
PJG#AR*  03  FILLER                 PIC X(14)  VALUE '0009088810000A'.
PJG#AR*  03  FILLER                 PIC X(14)  VALUE '0009088812000A'.
PJG#I    03  FILLER                 PIC X(14)  VALUE '0009088813000A'.
PJG#I    03  FILLER                 PIC X(14)  VALUE '0009100008000A'.
PJG#I    03  FILLER                 PIC X(14)  VALUE '0009110003000A'.
PJG#I    03  FILLER                 PIC X(14)  VALUE '0009120009000A'.
PJG#I    03  FILLER                 PIC X(14)  VALUE '0009130004000A'.
PJG#I    03  FILLER                 PIC X(14)  VALUE '0009140018000A'.
PJG#AR*  03  FILLER                 PIC X(14)  VALUE '0009150005000A'.
PJG#I    03  FILLER                 PIC X(14)  VALUE '0009160019000A'.
PJG#I    03  FILLER                 PIC X(14)  VALUE '0009170006000A'.
PJG#I    03  FILLER                 PIC X(14)  VALUE '0009180001000A'.
PJG#I    03  FILLER                 PIC X(14)  VALUE '0009210012000A'.
PJG#I    03  FILLER                 PIC X(14)  VALUE '0009250006000A'.
PJG#I    03  FILLER                 PIC X(14)  VALUE '0009260001000A'.
PJG#I    03  FILLER                 PIC X(14)  VALUE '0009270007000A'.
PJG#I    03  FILLER                 PIC X(14)  VALUE '0009280002000A'.
PJG#I    03  FILLER                 PIC X(14)  VALUE '0009290008000A'.
PJG#I    03  FILLER                 PIC X(14)  VALUE '0009310005000A'.
PJG#I    03  FILLER                 PIC X(14)  VALUE '0009320019000A'.
PJG#I    03  FILLER                 PIC X(14)  VALUE '0009330006000A'.
PJG#I    03  FILLER                 PIC X(14)  VALUE '0009340001000A'.
PJG#I    03  FILLER                 PIC X(14)  VALUE '0009350007000A'.
PJG#AR*  03  FILLER                 PIC X(14)  VALUE '0009370008000A'.
PJG#I    03  FILLER                 PIC X(14)  VALUE '0009380003000A'.
PJG#I    03  FILLER                 PIC X(14)  VALUE '0009390009000A'.
PJG#I    03  FILLER                 PIC X(14)  VALUE '0009400019000A'.
PJG#AR*  03  FILLER                 PIC X(14)  VALUE '0009420001000A'.
PJG#I    03  FILLER                 PIC X(14)  VALUE '0009440002000A'.
PJG#I    03  FILLER                 PIC X(14)  VALUE '0009450008000A'.
PJG#I    03  FILLER                 PIC X(14)  VALUE '0009460003000A'.
PJG#I    03  FILLER                 PIC X(14)  VALUE '0009480004000A'.
PJG#AR*  03  FILLER                 PIC X(14)  VALUE '0009500001000A'.
PJG#I    03  FILLER                 PIC X(14)  VALUE '0009510007000A'.
PJG#I    03  FILLER                 PIC X(14)  VALUE '0009530008000A'.
PJG#I    03  FILLER                 PIC X(14)  VALUE '0009540003000A'.
PJG#AR*  03  FILLER                 PIC X(14)  VALUE '0009550009000A'.
PJG#I    03  FILLER                 PIC X(14)  VALUE '0009560004000A'.
PJG#I    03  FILLER                 PIC X(14)  VALUE '0009570018000A'.
PJG#AR*  03  FILLER                 PIC X(14)  VALUE '0009580005000A'.
PJG#I    03  FILLER                 PIC X(14)  VALUE '0009590000000A'.
PJG#I    03  FILLER                 PIC X(14)  VALUE '0009600002000A'.
PJG#I    03  FILLER                 PIC X(14)  VALUE '0009610008000A'.
PJG#I    03  FILLER                 PIC X(14)  VALUE '0009620003000A'.
PJG#AR*  03  FILLER                 PIC X(14)  VALUE '0009640004000A'.
PJG#I    03  FILLER                 PIC X(14)  VALUE '0009650018000A'.
PJG#I    03  FILLER                 PIC X(14)  VALUE '0009690001000A'.
PJG#AR*  03  FILLER                 PIC X(14)  VALUE '0009700003000A'.
PJG#I    03  FILLER                 PIC X(14)  VALUE '0009710009000A'.
PJG#I    03  FILLER                 PIC X(14)  VALUE '0009720004000A'.
PJG#I    03  FILLER                 PIC X(14)  VALUE '0009730018000A'.
PJG#AR*  03  FILLER                 PIC X(14)  VALUE '0009740005000A'.
PJG#AR*  03  FILLER                 PIC X(14)  VALUE '0009750000000A'.
PJG#I    03  FILLER                 PIC X(14)  VALUE '0009760006000A'.
PJG#AR*  03  FILLER                 PIC X(14)  VALUE '0009770001000A'.
PJG#AR*  03  FILLER                 PIC X(14)  VALUE '0009780007000A'.
PJG#I    03  FILLER                 PIC X(14)  VALUE '0009840006000A'.
PJG#AR*  03  FILLER                 PIC X(14)  VALUE '0009860007000A'.
PJG#AR*  03  FILLER                 PIC X(14)  VALUE '0009860008000A'.
PJG#AR*  03  FILLER                 PIC X(14)  VALUE '0009860009000A'.
PJG#I    03  FILLER                 PIC X(14)  VALUE '0009870010000A'.
PJG#AR*  03  FILLER                 PIC X(14)  VALUE '0009880008000A'.
PJG#AR*  03  FILLER                 PIC X(14)  VALUE '0009920006000A'.
PJG#AR*  03  FILLER                 PIC X(14)  VALUE '0009920049000A'.
PJG#AR*  03  FILLER                 PIC X(14)  VALUE '0009920050000A'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0009999999050C'.
#AI#AP*  03  FILLER                 PIC X(14)  VALUE '0010721461000C'.
#AC#AN*  03  FILLER                 PIC X(14)  VALUE '0012000282000C'.
#33#37*  03  FILLER                 PIC X(14)  VALUE '0012000506000C'.
#AC#AN*  03  FILLER                 PIC X(14)  VALUE '0012005040000C'.
PJG#H *#AP 03 FILLER                PIC X(14)  VALUE '0012006027000C'.
#AC#AP*  03  FILLER                 PIC X(14)  VALUE '0012008188000C'.
#66#AO*  03  FILLER                 PIC X(14)  VALUE '0012010528000C'.
#AI#AN*  03  FILLER                 PIC X(14)  VALUE '0012888103000C'.
#AI#AN*  03  FILLER                 PIC X(14)  VALUE '0012888111000C'.
#AI#AN*  03  FILLER                 PIC X(14)  VALUE '0012888138000C'.
#AI#AN*  03  FILLER                 PIC X(14)  VALUE '0012888146000C'.
#AI#AP*  03  FILLER                 PIC X(14)  VALUE '0012888197000C'.
#AI#AN*  03  FILLER                 PIC X(14)  VALUE '0012888883000C'.
#AI#AN*  03  FILLER                 PIC X(14)  VALUE '0012888891000C'.
PJG#D *  03  FILLER                 PIC X(14)  VALUE '0012990018000C'.
PJG#D *  03  FILLER                 PIC X(14)  VALUE '0012990025000C'.
#AI#AN*  03  FILLER                 PIC X(14)  VALUE '0012990030000C'.
#89#AP*  03  FILLER                 PIC X(14)  VALUE '0012990032000C'.
#90#AP*  03  FILLER                 PIC X(14)  VALUE '0012990335000C'.
#72#AP*  03  FILLER                 PIC X(14)  VALUE '0012991207000C'.
#91#AP*  03  FILLER                 PIC X(14)  VALUE '0012991346000C'.
#91#AP*  03  FILLER                 PIC X(14)  VALUE '0012991354000C'.
PJG#AO*  03  FILLER                 PIC X(14)  VALUE '0012991370000C'.
#93#AP*  03  FILLER                 PIC X(14)  VALUE '0012991880000C'.
#95#AP*  03  FILLER                 PIC X(14)  VALUE '0012991936000C'.
#79#AP*  03  FILLER                 PIC X(14)  VALUE '0012992576000C'.
#79#AP*  03  FILLER                 PIC X(14)  VALUE '0012992580000C'.
PJG#AO*  03  FILLER                 PIC X(14)  VALUE '0012992779000C'.
#77#AP*  03  FILLER                 PIC X(14)  VALUE '0012992867000C'.
#79#AP*  03  FILLER                 PIC X(14)  VALUE '0012993107000C'.
#70#AP*  03  FILLER                 PIC X(14)  VALUE '0012993114000C'.
#79#AP*  03  FILLER                 PIC X(14)  VALUE '0012993116000C'.
#79#AP*  03  FILLER                 PIC X(14)  VALUE '0012993135000C'.
#80#AP*  03  FILLER                 PIC X(14)  VALUE '0012993974000C'.
#68#AP*  03  FILLER                 PIC X(14)  VALUE '0012994248000C'.
#48#AO*  03  FILLER                 PIC X(14)  VALUE '0012994344000C'.
#83#AP*  03  FILLER                 PIC X(14)  VALUE '0012994352000C'.
#AB#AP*  03  FILLER                 PIC X(14)  VALUE '0012994379000C'.
#AK#AP*  03  FILLER                 PIC X(14)  VALUE '0012994440000C'.
#39#AO*  03  FILLER                 PIC X(14)  VALUE '0012994803000C'.
#39#AO*  03  FILLER                 PIC X(14)  VALUE '0012994985000C'.
#AI#AN*  03  FILLER                 PIC X(14)  VALUE '0012999006000C'.
#AI#AN*  03  FILLER                 PIC X(14)  VALUE '0012999145000C'.
#AI#AP*  03  FILLER                 PIC X(14)  VALUE '0016999927000C'.
#AI#AP*  03  FILLER                 PIC X(14)  VALUE '0016999994000C'.
PJG#K *  03  FILLER                 PIC X(14)  VALUE '0019061766000C'.
#40#AO*  03  FILLER                 PIC X(14)  VALUE '0019127059000C'.
#43#AO*  03  FILLER                 PIC X(14)  VALUE '0019139383000C'.
#69#AP*  03  FILLER                 PIC X(14)  VALUE '0019141109000C'.
#44#AO*  03  FILLER                 PIC X(14)  VALUE '0019160860000C'.
#93#AP*  03  FILLER                 PIC X(14)  VALUE '0019171498000C'.
PJG#AO*  03  FILLER                 PIC X(14)  VALUE '0019190453000C'.
PJG#K *  03  FILLER                 PIC X(14)  VALUE '0019201116000C'.
#89#AP*  03  FILLER                 PIC X(14)  VALUE '0019202776000C'.
#63#AP*  03  FILLER                 PIC X(14)  VALUE '0019202901000C'.
#94#AP*  03  FILLER                 PIC X(14)  VALUE '0019237688000C'.
#AG#AP*  03  FILLER                 PIC X(14)  VALUE '0019242276000C'.
#94#AP*  03  FILLER                 PIC X(14)  VALUE '0019244642000C'.
#90#AP*  03  FILLER                 PIC X(14)  VALUE '0019260511000C'.
#74#AP*  03  FILLER                 PIC X(14)  VALUE '0019261012000C'.
#79#AP*  03  FILLER                 PIC X(14)  VALUE '0019261143000C'.
#46#AO*  03  FILLER                 PIC X(14)  VALUE '0019261186000C'.
#86#AP*  03  FILLER                 PIC X(14)  VALUE '0019282913000C'.
PJG#D *  03  FILLER                 PIC X(14)  VALUE '0019286324000C'.
#63#81*  03  FILLER                 PIC X(14)  VALUE '0019287220000C'.
GO2#AO*  03  FILLER                 PIC X(14)  VALUE '0019299563000C'.
#83#AP*  03  FILLER                 PIC X(14)  VALUE '0019312107000C'.
#54#AO*  03  FILLER                 PIC X(14)  VALUE '0019314735000C'.
#66#AP*  03  FILLER                 PIC X(14)  VALUE '0019314866000C'.
#78#AP*  03  FILLER                 PIC X(14)  VALUE '0030704495000C'.
#59#AO*  03  FILLER                 PIC X(14)  VALUE '0030705150000C'.
#63#AO*  03  FILLER                 PIC X(14)  VALUE '0030722875000C'.
#61#AO*  03  FILLER                 PIC X(14)  VALUE '0030723478000C'.
#77#AP*  03  FILLER                 PIC X(14)  VALUE '0030724301000C'.
#79#AP*  03  FILLER                 PIC X(14)  VALUE '0030826649000C'.
#AM#AP*  03  FILLER                 PIC X(14)  VALUE '0030931456000C'.
#37#AP*  03  FILLER                 PIC X(14)  VALUE '0031033207000C'.
#87#AP*  03  FILLER                 PIC X(14)  VALUE '0031134553000C'.
#56#AP*  03  FILLER                 PIC X(14)  VALUE '0031237577000C'.
#72#AP*  03  FILLER                 PIC X(14)  VALUE '0034148213000C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '0040000000087C'.
#97#AP*  03  FILLER                 PIC X(14)  VALUE '0040707815000C'.
#89#AO*  03  FILLER                 PIC X(14)  VALUE '0040724156000C'.
#72#AO*  03  FILLER                 PIC X(14)  VALUE '0040724201000C'.
#95#AP*  03  FILLER                 PIC X(14)  VALUE '0040724397000C'.
#70#AP*  03  FILLER                 PIC X(14)  VALUE '0040827335000C'.
#82#AP*  03  FILLER                 PIC X(14)  VALUE '0040929080000C'.
#97#AP*  03  FILLER                 PIC X(14)  VALUE '0040930055000C'.
PJG#D *  03  FILLER                 PIC X(14)  VALUE '0040930449000C'.
#62#AP*  03  FILLER                 PIC X(14)  VALUE '0041033848000C'.
#79#AP*  03  FILLER                 PIC X(14)  VALUE '0041134410000C'.
PJG#AO*  03  FILLER                 PIC X(14)  VALUE '0041134714000C'.
#58#AP*  03  FILLER                 PIC X(14)  VALUE '0041135188000C'.
PJG#AO*  03  FILLER                 PIC X(14)  VALUE '0041135328000C'.
PJG#N *#AP 03 FILLER                PIC X(14)  VALUE '0041237073000C'.
#AF#AP*  03  FILLER                 PIC X(14)  VALUE '0041339264000C'.
#74#AP*  03  FILLER                 PIC X(14)  VALUE '0041339489000C'.
   #AO*  03  FILLER                 PIC X(14)  VALUE '00430*****086C'.
PJG#D *  03  FILLER                 PIC X(14)  VALUE '00431*****086C'.
PJG#D *  03  FILLER                 PIC X(14)  VALUE '00432*****086C'.
PJG#D *  03  FILLER                 PIC X(14)  VALUE '00433*****086C'.
PJG#D *  03  FILLER                 PIC X(14)  VALUE '00434*****086C'.
PJG#D *  03  FILLER                 PIC X(14)  VALUE '00435*****086C'.
PJG#D *  03  FILLER                 PIC X(14)  VALUE '00436*****086C'.
PJG#D *  03  FILLER                 PIC X(14)  VALUE '00437*****086C'.
PJG#D *  03  FILLER                 PIC X(14)  VALUE '00438*****086C'.
PJG#D *  03  FILLER                 PIC X(14)  VALUE '00439*****086C'.
#89#AP*  03  FILLER                 PIC X(14)  VALUE '0044601111000C'.
#59#AP*  03  FILLER                 PIC X(14)  VALUE '0070000002000C'.
#53#AP*  03  FILLER                 PIC X(14)  VALUE '0070000010000C'.
#97#AP*  03  FILLER                 PIC X(14)  VALUE '0070000035000C'.
#AI#AP*  03  FILLER                 PIC X(14)  VALUE '0070000055000C'.
PJG#AO*  03  FILLER                 PIC X(14)  VALUE '0070000144000C'.
PJG#AO*  03  FILLER                 PIC X(14)  VALUE '0070000157000C'.
PJG#AO*  03  FILLER                 PIC X(14)  VALUE '0070000180000C'.
#77#AP*  03  FILLER                 PIC X(14)  VALUE '0070000192000C'.
PJG#AO*  03  FILLER                 PIC X(14)  VALUE '0070000195000C'.
#43#AO*  03  FILLER                 PIC X(14)  VALUE '0070000223000C'.
#32#AO*  03  FILLER                 PIC X(14)  VALUE '0070000229000C'.
#63#AP*  03  FILLER                 PIC X(14)  VALUE '0070000231000C'.
#89#AP*  03  FILLER                 PIC X(14)  VALUE '0070000244000C'.
#AC#AP*  03  FILLER                 PIC X(14)  VALUE '0070000245000C'.
#55#AO*  03  FILLER                 PIC X(14)  VALUE '0070000254000C'.
#73#AO*  03  FILLER                 PIC X(14)  VALUE '0070000285000C'.
#65#AP*  03  FILLER                 PIC X(14)  VALUE '0070000289000C'.
PJG#G *#AP 03 FILLER                PIC X(14)  VALUE '0070000329000C'.
#34#AO*  03  FILLER                 PIC X(14)  VALUE '0070000339000C'.
PJG#AO*  03  FILLER                 PIC X(14)  VALUE '0070000347000C'.
   #AQ   03  FILLER                 PIC X(14)  VALUE '9999906028000E'.
       01  FILLER  REDEFINES  TABELA-AGDT.
PJG#1 *  03  TAB-AGDT OCCURS 2090 TIMES
PJG#2 *  03  TAB-AGDT OCCURS 2093 TIMES
PJG#3 *  03  TAB-AGDT OCCURS 2082 TIMES
PJG#4 *  03  TAB-AGDT OCCURS 2087 TIMES
PJG#5 *  03  TAB-AGDT OCCURS 2089 TIMES
   #12*  03  TAB-AGDT OCCURS 2090 TIMES
PJG#6 *  03  TAB-AGDT OCCURS 2091 TIMES
PJG#7 *  03  TAB-AGDT OCCURS 2092 TIMES
PJG#8 *  03  TAB-AGDT OCCURS 2093 TIMES
PJG#9 *  03  TAB-AGDT OCCURS 2098 TIMES
PJG#A *  03  TAB-AGDT OCCURS 2099 TIMES
PJG#B *  03  TAB-AGDT OCCURS 2098 TIMES
PJG#C *  03  TAB-AGDT OCCURS 2100 TIMES
   #20*  03  TAB-AGDT OCCURS 2101 TIMES
PJG#D *  03  TAB-AGDT OCCURS 2102 TIMES
PJG#E *  03  TAB-AGDT OCCURS 1989 TIMES
PJG#F *  03  TAB-AGDT OCCURS 1993 TIMES
PJG#G *  03  TAB-AGDT OCCURS 1995 TIMES
PJG#H *  03  TAB-AGDT OCCURS 1998 TIMES
PJG#I *  03  TAB-AGDT OCCURS 2009 TIMES
PJG#J *  03  TAB-AGDT OCCURS 2248 TIMES
PJG#K *  03  TAB-AGDT OCCURS 2249 TIMES
PJG#L *  03  TAB-AGDT OCCURS 2256 TIMES
   #30*  03  TAB-AGDT OCCURS 2261 TIMES
#30#31*  03  TAB-AGDT OCCURS 2264 TIMES
#31#32*  03  TAB-AGDT OCCURS 2268 TIMES
#32#33*  03  TAB-AGDT OCCURS 2269 TIMES
#33#34*  03  TAB-AGDT OCCURS 2272 TIMES
#34#35*  03  TAB-AGDT OCCURS 2273 TIMES
#35****  03  TAB-AGDT OCCURS 2274 TIMES
GO2291*  03  TAB-AGDT OCCURS 2275 TIMES
#38#39*  03  TAB-AGDT OCCURS 2276 TIMES
#39#40*  03  TAB-AGDT OCCURS 2278 TIMES
#40#41*  03  TAB-AGDT OCCURS 2280 TIMES
#41#42*  03  TAB-AGDT OCCURS 2279 TIMES
#42#43*  03  TAB-AGDT OCCURS 2281 TIMES
#43#44*  03  TAB-AGDT OCCURS 2283 TIMES
#44#45*  03  TAB-AGDT OCCURS 2288 TIMES
#45#46*  03  TAB-AGDT OCCURS 2289 TIMES
#46#47*  03  TAB-AGDT OCCURS 2291 TIMES
#47#48*  03  TAB-AGDT OCCURS 2292 TIMES
#48#49*  03  TAB-AGDT OCCURS 2293 TIMES
#49#50*  03  TAB-AGDT OCCURS 2294 TIMES
#50#51*  03  TAB-AGDT OCCURS 2295 TIMES
#51#52*  03  TAB-AGDT OCCURS 2296 TIMES
#52#53*  03  TAB-AGDT OCCURS 2302 TIMES
#53#54*  03  TAB-AGDT OCCURS 2301 TIMES
#54#55*  03  TAB-AGDT OCCURS 2310 TIMES
#55#56*  03  TAB-AGDT OCCURS 2314 TIMES
#56#57*  03  TAB-AGDT OCCURS 2317 TIMES
#57#58*  03  TAB-AGDT OCCURS 2320 TIMES
#58#59*  03  TAB-AGDT OCCURS 2321 TIMES
#59#60*  03  TAB-AGDT OCCURS 2327 TIMES
#60#61*  03  TAB-AGDT OCCURS 2329 TIMES
#61#62*  03  TAB-AGDT OCCURS 2330 TIMES
#62#63*  03  TAB-AGDT OCCURS 2331 TIMES
#63#64*  03  TAB-AGDT OCCURS 2335 TIMES
#64#65*  03  TAB-AGDT OCCURS 2336 TIMES
#65#66*  03  TAB-AGDT OCCURS 2338 TIMES
#66#67*  03  TAB-AGDT OCCURS 2342 TIMES
#67#68*  03  TAB-AGDT OCCURS 2345 TIMES
#68#69*  03  TAB-AGDT OCCURS 2347 TIMES
#69#70*  03  TAB-AGDT OCCURS 2351 TIMES
#70#71*  03  TAB-AGDT OCCURS 2356 TIMES
#71#72*  03  TAB-AGDT OCCURS 2358 TIMES
#72#73*  03  TAB-AGDT OCCURS 2368 TIMES
#73#74*  03  TAB-AGDT OCCURS 2370 TIMES
#74#75*  03  TAB-AGDT OCCURS 2373 TIMES
#75#76*  03  TAB-AGDT OCCURS 2383 TIMES
#76#77*  03  TAB-AGDT OCCURS 2384 TIMES
#77#78*  03  TAB-AGDT OCCURS 2390 TIMES
#78#79*  03  TAB-AGDT OCCURS 2394 TIMES
#79#80*  03  TAB-AGDT OCCURS 2407 TIMES
#80#81*  03  TAB-AGDT OCCURS 2410 TIMES
#81#82*  03  TAB-AGDT OCCURS 2411 TIMES
#82#83*  03  TAB-AGDT OCCURS 2416 TIMES
PJG#M *  03  TAB-AGDT OCCURS 2419 TIMES
PJG#N *  03  TAB-AGDT OCCURS 2420 TIMES
PJG#86*  03  TAB-AGDT OCCURS 2421 TIMES
#86#87*  03  TAB-AGDT OCCURS 2424 TIMES
#87#88*  03  TAB-AGDT OCCURS 2426 TIMES
#88#89*  03  TAB-AGDT OCCURS 2427 TIMES
#89#90*  03  TAB-AGDT OCCURS 2437 TIMES
#90#91*  03  TAB-AGDT OCCURS 2442 TIMES
#91#92*  03  TAB-AGDT OCCURS 2444 TIMES
#92#93*  03  TAB-AGDT OCCURS 2452 TIMES
#93#94*  03  TAB-AGDT OCCURS 2463 TIMES
#94#95*  03  TAB-AGDT OCCURS 2469 TIMES
#95#96*  03  TAB-AGDT OCCURS 2474 TIMES
#96#97*  03  TAB-AGDT OCCURS 2483 TIMES
#97#98*  03  TAB-AGDT OCCURS 2498 TIMES
#98#99*  03  TAB-AGDT OCCURS 2499 TIMES
#99#AA*  03  TAB-AGDT OCCURS 2500 TIMES
#AA#AB*  03  TAB-AGDT OCCURS 2501 TIMES
#AB#AC*  03  TAB-AGDT OCCURS 2503 TIMES
#AC#AD*  03  TAB-AGDT OCCURS 2515 TIMES
#AD#AE*  03  TAB-AGDT OCCURS 2516 TIMES
#AE#AF*  03  TAB-AGDT OCCURS 2518 TIMES
#AF#AG*  03  TAB-AGDT OCCURS 2522 TIMES
#AG#AH*  03  TAB-AGDT OCCURS 2524 TIMES
#AH#AI*  03  TAB-AGDT OCCURS 2529 TIMES
#AI#AJ*  03  TAB-AGDT OCCURS 2559 TIMES
#AJ#AK*  03  TAB-AGDT OCCURS 2562 TIMES
#AK#AL*  03  TAB-AGDT OCCURS 2563 TIMES
#AL#AM*  03  TAB-AGDT OCCURS 2564 TIMES
#AM#AN*  03  TAB-AGDT OCCURS 2566 TIMES
#AN#AO*  03  TAB-AGDT OCCURS 2547 TIMES
#AO#AP*  03  TAB-AGDT OCCURS 1580 TIMES
#AP#AQ*  03  TAB-AGDT OCCURS 1362 TIMES
#AQ#AR*  03  TAB-AGDT OCCURS 1363 TIMES
#AR      03  TAB-AGDT OCCURS  392 TIMES
               ASCENDING KEY TAB-AGDT-AGENTE
                  INDEXED BY Y.
           05  TAB-AGDT-AGENTE      PIC X(10).
           05  TAB-AGDT-DISTRI      PIC X(03).
           05  TAB-AGDT-IMPRIM      PIC X(01).
